{"meta":{"title":"MYTH's Wiki","subtitle":"","description":"","author":"sunwucheng","url":"https://sunwucheng.com/wiki","root":"/wiki/"},"pages":[],"posts":[{"title":"IDB_diamond_damage","slug":"Research/IDB_diamond_damage","date":"2022-01-31T16:00:00.000Z","updated":"2022-07-06T10:46:26.000Z","comments":true,"path":"20220201/","link":"","permalink":"https://sunwucheng.com/wiki/20220201/","excerpt":"","text":"","categories":[{"name":"Research","slug":"Research","permalink":"https://sunwucheng.com/wiki/categories/Research/"}],"tags":[]},{"title":"IDB_matrix_wear","slug":"Research/IDB_matrix_wear","date":"2021-12-31T16:00:00.000Z","updated":"2022-09-27T01:42:10.549Z","comments":true,"path":"20220101/","link":"","permalink":"https://sunwucheng.com/wiki/20220101/","excerpt":"","text":"W. Sun, H. Gao, S. Tan, Z. Wang, L. Duan, Wear detection of WC-Cu based impregnated diamond bit matrix based on SEM image and deep learning, Int. J. Refract. Met. Hard Mater. 98 (2021) 105530. https://doi.org/10.1016/j.ijrmhm.2021.105530. https://github.com/sunwucheng/IDB_matrix_wear","categories":[{"name":"Research","slug":"Research","permalink":"https://sunwucheng.com/wiki/categories/Research/"}],"tags":[]},{"title":"IELTS","slug":"English/IELTS","date":"2020-11-30T16:00:00.000Z","updated":"2022-03-26T01:37:34.081Z","comments":true,"path":"20201201/","link":"","permalink":"https://sunwucheng.com/wiki/20201201/","excerpt":"","text":"备考雅思（A类）雅思备考指南 https://ielts.kmf.com/guide雅思考试流程08:00 — 08:20 到达考点，根据雅思确认信上的报考号在考场入口处查询教室08:20 — 08:30 进入考场（8:30后禁止进入考场）08:30 — 09:00 考官宣读雅思考场规则和考相关内容09:00 — 09:30 听力部分09:30 — 09:40 雅思考试听力誊写答题纸时间09:40 — 09:45 收听力卷，发阅读卷（听力答题纸不收，因为背面为阅读答题纸）09:45 — 10:45 阅读部分（无额外誊写答题纸时间，童鞋们一定注意时间分配）10:45 — 10:50 收阅读卷和听力阅读答题纸，发写作卷10:50 — 11:50 写作部分（task one +task two）PLS1：考场上会有5分钟左右的差异，考官会根据实际时间为大准确计时，并把相关每个阶段的时间写在黑板上PLS2：务必别忘带护照照片，雅思确认信，身份证口语：周六下午或者周日某个半天，按照确认信上规定时间提前15到30分钟到达口语考场，等待身份确认，等待考试。\\ IELTS-SimonIELTS ListeningIELTS Listening Lesson 1Know the test: You only hear the recordings once About 30 minutes Extra 10 minutes at the end 40 questions 4 sections of 10 questions Answers are always in order Only 3 main types of question: gap-fill, multiple choice, matching Various English accents You only hear the recordings once! Section 1 two speakers an ‘every day’ conversation, e.g., making a booking one speaker gives basic information simple gap-fill: missing details names, addresses, dates, times, numbers section 1 is easy, but you need a high score (9 or 10 correct) Key technique: Use the breaks to read ahead (Don’t check back, read ahead) before each section starts in the middle of each section (except in section 4) at the end of each section Section 2 use all of the break time at the end of section 1 one speaker only a short speech about a non-academic topic, e.g., tourism, a park, local facilities gap-fill, multiple, choice, matching still quite easy, aim for a high score Section 3 use breaks to read and underline two or three speakers conversation related to education or training, e.g., tutor and student gap-fill, multiple choice (difficult) underline keywords in questions and choices listen for keywords or synonyms difficult section, aim for 6 or 7 Section 4 use break at the end of section 3 underline keywords no break in the middle! one speaker only speech about an academic topic gap-fill, multiple choice listen for keywords or synonyms difficult: faster speech, more content, extra information Know the test: Do some real practice tests Tips Read ahead (only check back at the end) Underline keywords Listen for keywords or synonyms Be careful with spelling Don’t get stuck on a difficult question - move forward Concentrate! IELTS Listening Lesson 2Examples and practice: example questions for the 4 sections Section 1: gap-fill, basic information Section 2: gap-fill, multiple choice, matching Section 3: gap-fill, multiple choice Section 4: gap-fill, multiple choice IELTS ReadingCourse summary The main technique - Keyword technique It’s a vocabulary test Question types Gap-fill True/false/not given Yes/no/not given Multiple choice Short answer questions Matching paragraph headings Matching paragraph information Matching names Matching sentence endings The time problem read at a normal speed use the keyword technique miss any difficult questions 20 minutes for each passage Lots of practice official Cambridge IELTS books Simon videos and blog lessons slowly and carefully high score first, get faster later lesson 1IELTS reading 1 hour, 40 questions Read the passages and answer questions about the information Reading comprehension Testing your understanding of written English A vocabulary test lesson 2 Basic exam techniques, gap-fill questionsBasic exam techniques Don’t read the passage first Just read the title Then go to the first question Underline ‘keywords’ in the question Then search for those words in the passage Underline them Read that part of the passage carefully Try to get the answer Three more pieces of advice Read at normal speed Only skim / scan for names or numbers Miss any difficult questions, get to the end Question types Gap-fill True / false / not given Yes / no / not given Multiple choice Matching paragraph headings Matching paragraph information Matching sentence endings Matching other features e.g. names Short answer questions Types of ‘gap-fill’ question Fill the gapes with words from the passage Fill the gaps to label a diagram Fill the gaps with words from a list / box Fill the gaps in a table lesson 3 True, false, not given; yes, no, not givenIs there a difference between the following? True, False, Not given: When the passage is about facts (Are the statements true according to the information in the passage?) Yes, No, Not given: When the passage is about the writer’s reviews (Do the statements agree with the views expressed by the writer?) Tips These differences are not important! We can approach both question types in the same way. Just think: correct, incorrect, not given. Remember True/Yes - the correct information is given False/No - different information is given, contradicting the statement Not given - we don’t know the answer; there isn’t enough information Find the ‘keywords’ and then compare the question and passage carefully Answers are always in the correct order in the passage Lesson 4 Matching paragraph headings List of headings Choose the best heading for each paragraph in the passage ‘Paragraph headings’ questions are difficult… because the answers are not in order in the passage because some of the headings may be similar Techniques Do ‘paragraph headings’ questions last Do all other questions for that passage first You will then be more familiar with the passage You might get some of the answers from memory Underline ‘keywords’ in each heading on the list Then read the shortest or easiest paragraph Read at normal speed Underline the main ideas in the paragraph Compare with all of the headings Choose the best one Lesson 5 Which paragraph contains? List of statements Find which paragraph contains the information in each statement ‘Which paragraph contains’ questions are difficult… because the answers are not in order in the passage the same paragraph may contain more than one answer some of the paragraphs may not contain any answers Techniques Do ‘which paragraph contains’ questions last Do all other questions for that passage first You will then be more familiar with the passage You might get some of the answers from memory Underline ‘keywords’ in each statement Then start with the easiest statement Information that you remember reading about Easy keywords that you can scan for Lesson 6 Multiple choice questionsMultiple choice questions Can be difficult because there is a lot to read, and the choices can be similar and confusing You can normally find the answers in order in the passage Lesson 7 Matching names A list of question statements A box containing a list of names ‘Matching names’ sections can be difficult because… the answers are not in order in the passage one name may be used for more than one answer (if it matches more than one of the statements) some of the names may not be needed Techniques Underline ‘keywords’ in each statement Scan the passage to find all of the names Highlight each name clearly (e.g. circle them) Choose the name with the shortest description read the sentences around that name underline the main ideas relating to that name Compare with all of the questions statements go through the question statements to see if any of them match what you read Lesson 8 ‘Short answer’ questionsMethod/techniques: ‘keyword technique’(lesson 2) Lesson 9 Matching sentence endingsFirst, underline keywords in the sentence endingsNext, start with question 1 Remember: Underline keywords in the sentence endings Then start with the first question Underline keywords in the question Read the passage at normal speed Underline keywords that you find Compare the passage with the sentence endings Choose the best one IELTS SpeakingLesson 1 3 parts of the test scoring system some overall advice Timing, 3 parts of the test 11 to 14 minutes overall timing is very strict Part 1: 4 to 5 minutes Part 2: 3 to 4 minutes Part 3: 4 to 5 minutes Scoring system (4 scores, 25% each) Fluency and coherence (speak fluently and the answer make sense) Vocabulary (good language in your answers) Grammar (reduce the number of mistakes that you make) Pronunciation (not about accent, but about how clearly you pronounce your words and phrases) Some tips be ready (know what to expect and what the examiner expects from you) Part 1: there is going to be fast questions and you should give short fast answers natural language, not difficult language Difficult words and grammar will just make you speak more slowly as you are thinking Answer as quickly as you can (hesitation could affect your fluency score) Just say the first thing that comes into your head and keep going about that The examiner is not judging the quality of your answers They are looking at the language that you use and fluency of those answers Don’t worry about body language eye contact the quality of your ideas (or opinions) whether the examiner agrees with you presentation skills the examiner’s behaviour Aims of this course Give you a method Prepare topics and common questions Lesson 2 IELTS speaking Part 1Speaking part 1 4 to 5 minutes 10 or 11 questions 3 topic areas easy! The examiner will start with 2 or 3 questions about your work or your studies or way you live, and then they will move on to 4 questions about one short topic and another 4 questions a second mini topic Remember try to show fluency (key in speak part 1) don’t stop and think (hesitation is when your fluency stops: emm, ahh…) don’t worry about vocabulary or grammar (don’t show off your best language) no need of difficult vocabulary or complex grammar, which won’t help you try to focus on fluency, just say the first thing that come into your head answer as quickly as you can and don’t worry about the quality of your ideas it’s an easy warm-up give short , simple answers You can’t get a high score from part 1, but from part 2 and 3 What’s the best technique? answer the question, then given a reason give short, simple answers, but use full sentences stop with confidence, don’t keep talking, smile at the examiner! Topics: often seem childish Q: What’s your favorite colour? A: My favorite colour is blue because it’s the color of the sky on a nice day. A good way to practice E: Do you like … (games/walking/gardens/flowers/dancing)? Lesson 3 IELTS speaking part 2 1/6 Describe a person 3 to 4 minutes 1 minute to repare speak for 2 minutes task card describe… the examiners starts by giving you a task card, a piece of paper /card with a question written on that, a question task, and that task question always begin with ‘describe… ‘, then the examiner also gives you a pencil and a piece of paper for making notes (one minute to make notes on the task) Make notes: Quickly decide what you’re going to talk about think the first thing that comes into your head, make that decision, and then make some notes about thatTechnique: Follow the points on the task card They help your structure and give you something to say. Say as much as you can for each point. Before the exam prepare for common topic areas vocabulary and ideas are the key Topics, techniques, vocabulary, example question 6 main topic area: describe (1)a person; (2)a place; (3)an object; (4)an event; (5)an activity; (6)your favourites prepare ideas and vocabulary, not grammar or linking speak naturally, explain in detail (content, not structure) Describe a person types teacher famous person friend family member child someone who helps people someone who does something well points who (appearance, personality) what he / she does when / how / where you met how you know about this person why you like this person preparation tip think of a ‘theme’ for any person (friend, family, famous, child etc.) start with easy adjectives search for better words and phrases example: theme = hardworking; adjectives = busy, active; better words = conscientious, someone you can count on hard-working ‘theme’ enthusiastic energetic studious persistent motivated determined to succeed some who sees things through a good team player likes to challenge himself / herself friendly ‘theme’ kind, caring generous, unselfish big-hearted supportive down-to-earth, easy-going always there when you need him / her someone who cheers me up a big / magnetic personality lights up the room Final step in preparation: Think of example or stories to demonstrate each theme Theme: My brother is hardworking Example: I remember when he used to get up at 5am to do some extra work before school… You can’t prepare for everything: you will need to adapt your ideas and improvise in the test (practise, record, improve) Lesson 4 IELTS speaking part 2 2/6 Describe a placeIELTS Speaking Part2: Work on good ideas and vocabulary for the most common topic areas… NOT grammar or linking Describe a place type A a city (you’ve visited) a city (you would like to visit) somewhere you went on holiday a historic place a river, lake or sea a journey (where you went) type B (more specific place) a shop a restaurant a street market points which place its is (the name of the place) where it is what you did / can do there why you like it preparation tip think of a ‘theme’ for any place start with easy adjectives search for better words and phrases example: theme = an interesting place; adjectives = fun, lively; better words = fascinating, unforgettable, the time flew by interesting / fun city ‘theme’ lively, bustling, hectic, thriving cosmopolitan, multicultural fascinating, unique a special atmosphere sightseeing, entertainment an unforgettable experience enjoyed every minute the time flew by endless things to see and do it was over too quickly historic ‘theme’ old buildings, palaces, statues ancient monuments landmarks where great events took place connection to the past reminders of the past everywhere you look full of history a rich cultural heritage friendly ‘theme’ (e.g. restaurant) -welcoming, inviting warm, approachable polite thoughtful, attentive great atmosphere make you feel at home the sevice was excellent nothing was too much to ask an unforgettable evening Final step in preparation: Think of example or stories to demonstrate each theme Theme: The city was interesting… Example: We visited famous landmarks and attractions, such as… We lost track of time because… Theme: The restaurant was friendly Example: The waiters really made us feel special. They even surprised us with a birthday cake… Lesson 5 IELTS speaking part 2 3/6 Describe an objectDescribe an object what, where, who, how, why? something you own something you would like to won something you use every day a piece of electronic equipment a gift you received a gift you gave something old that you own what the object is where you got it who gave it to you how long you have this object why do you like this object Tips: choose an object that could be used for nay of the topics above (e.g. a watch) electronic watch features ‘theme’ smart watch synchronised with phone / computer contacts, phone, emails store music receive notifications search the web it responds to voice commands make ‘contactless’ purchases track exercise goals fashion accessory - it looks stunning electronic watch useful ‘theme’ various features and functions organise my life work, appointments, social life check calendar at a glance set reminders and notifications practical, functional, convenient the ultimate in portable devices instant access to… couldn’t live without it old watch inherited ‘theme’ an inheritance passed down to me by a family heirloom in the family for several generations an antique it has sentimental value I’m emotionally attached to it it reminds me of it brings back happy memories I’ll hand it down to my children old watch appearance parts: the face, the strap traditional clock dial and hands made of (leather, gold, silver) colour inscription / engraving on the back grandfather’s name engraved simple, minimalistic design timeless, classic elegant, stylish well-made, durable, resilient Final step in preparation: Think of example or stories to demonstrate each theme Theme: My watch is useful Example: If my watch hadn’t notified me, I would have forgotten that I had a dentist’s appointment. Theme: It has sentimental value Example: I remember that when I was a child, my grandfather taught me how to tell the time… Lesson 6 IELTS speaking part 2 4/6 Describe an eventDescribe an event what, where, who, why? what (type of) the event was where the event was who was in the event why did you like/enjoy/go to this event an important event in your life a festival in your country a party a celebration a sports event that you watched a concert or music event Tip: Prepare vocabulary ‘themes’ for any event a ‘special’ event memorable unforgettable, spectacular a day to remember it was a once-in-a-lifetime experience I had a great time I enjoyed every minute I was blown away I couldn’t have asked for more it exceeded my expectations where the event was the venue a perfect / prime location beautifully decorated the decoration / lighting was… spectacular, romantic alovely setting a fantastic atmosphere the atmosphere was electric we were impressed by… service, staff, attention to detail specific vocabulary wedding: bridge, groom, guests, ceremony, marriage, vows, speech, wedding reception party), flowers, clothing (dress), cake festival: what it commemorates, religious significance, gifts, decorations, customs, special meal, public holiday sports event: athlets, players, crowd, spectators, stadium, field/pitch/track, commentators, the contest, the score, the winner concert: band, group, orchestra, lighting, sound, stage, crowd, audience, instruments, voice, song, piece of music Final step in preparation: Think of example or stories to demonstrate each theme Theme: My sister’s wedding was special Example: I enjoyed the occasion because it was great to see my sister so happy on her big day Theme: The concert was spectacular Example: Suddenly the venue lit up, and the crowd sheered as the musicians came onto the stage A few more tips search on the Internet for ideas about the particular events that you would choose use my theme vocabulary, but also add your own themes and vocabulary ideas describe what happened step by step, from the beginning to the end of the event Lesson 7 IELTS speaking part 2 5/6 Describe an activityDescribe an activity what, where, who, why? a hobby a sport a game something healthy that you do something new that you have done recently a healthy sports (swimming) keep fit, stay in good condition get in better shape feel refreshed rejuvenated, invigorated gives me an energy boost a good cardiovascular workout build strength and endurance a low-impact sport helps to relieve stress relaxing, helps to clear my mind an enjoyable game (chess) board game, a chess set pieces e.g. king, queen, bishop taking the opponent’s pieces checkmate hone my skulls thinking ahead out-think / orbit the opponent concentration, mental workout problem solving, strategy, learn from mistakes / losses Final step in preparation: Think of example or stories to demonstrate each theme Theme: Swimming is relaxing Example: Yesterday I had a lot on my mind, but as soon as I hit the water, all of my troubles disappeared Theme: I learned from my losses Example: I had one friend who always beat me, but I copied his strategies when playing other people Tips search on the Internet for ideas about the hobbies or activities that you would choose use my theme vocabulary, but also add your own themes and ideas Lesson 8 IELTS speaking part 2 6/6 Describe your favouritesDescribe your favourite… film or TV programme song / piece of music book website advertisement tips: prepare vocabulary; use ideas from other topics what, when, where, who, how, why? what? film / TV / book: the story song: artist, style, instruments website: features advertisement: product, ‘story’ why? film / TV / book: your feelings song: feelings, emotions website: how you use it advertisement: opinions / effect prepare vocabulary - use ideas from other topics advertisement: use ideas from the ‘watch’ description (lesson 5) smartwatch e.g. Apple Watch synchronise with phone / computer contacts, photos, emails store music receive notifications search the web it responds to voice commands track exercise goals fashion accessory - it looks stunning song: use ideas from the ‘concert’ description (lesson 6) film soundtrack (e.g. James Bond) theme music orchestra instruments popular, well-known immediately recognisable creates expectation adventure, mystery, suspense exciting, dramatic, powerful film: James Bond the film is / was released the plot (story) the genre e.g. action, drama the cast: actors, roles, characters scenes, locations, special effects I thoroughly enjoyed it spectacular, entertaining great performances I was on the edge of my seat I was enthralled website: Facebook social networking website keep in contact with friends find people you’ve lost touch with post messages write status updates upload photos and videos post links to other websites check your news feed find people with shared interests connect with like-minded people book: novel or non-fiction novel storyline, plot, genre the author, the characters entertaining, enthralling I couldn’t put it down non-fiction / textbook topic, field, subject informative, fascinating, inspiring I learnt about / I found out about it opened my mind to… Tip: Search on the Internet for ideas about your favourites Lesson 9 IELTS speaking part 2 Questions that don’t fit into these 6 main topic areasExamples Describe an important choice that you had to make Describe an idea you had for improving something at work or college Describe a competition that you took part in Describe a meeting that you went to at work, college or school Describe a time when you were asked for your opinion in a survey Describe a journey that you remember well Describe an open-air or street market that you enjoyed visiting Describe a shop near where you live that you sometimes use Describe a conflict that you had, or a time when you became angry Describe a beautiful sky that you enjoyed looking at Describe an interesting story that someone told you Describe a law in your country that you think is good Describe a local news story that people in your area found interesting Describe a time when you were stuck in traffic or delayed when traveling Describe a time when you helped someone Advice - 3 things that you can do Adapt your ideas from a main topic competition - sport (activity topic) journey - place you visited shop - object or favourite beautiful sky - place story - event or person local news story - place, concert in traffic or delayed - place when you helped - place, object Talk about your job or studies important choice idea at work or college competition meeting survey conflict, a time you became angry in traffic or delayed when you helped someone Look through the lessons on ielts-simon blog open-air or street market law in your country an environment problem a business a prize that you’d like to win etc… Tip: Prepare some good ideas and vocabulary about your job or studiesTip: If none of this advice works… do your best, tell the truth Lesson 10 ELTS Speaking Part 3 IELTS Speaking Part 3 Between 3 and 6 questions Give long, detailed answers This is your final chance to impress the examiner! We need a method: follow 3 steps (or sometimes 4) Force yourself to follow these steps Otherwise your answers won’t have ‘direction’ Steps Answer the question directly Explain your answer (reasons) Give an example Explain the opposite / alternative (what would happen if …) Example (Question) Do you think it’s better to have clear aims for the future, or is it best to take each day as it comes? (Answer) I think it’s best to have a good idea of what you want to do with your life, especially in terms of studies and career. (Why) Having aims allows you to plan what you need to do today and tomorrow in order to achieve longer-term objectives. (Example) For example, if you want to become a doctor, you need to choose the right subjects at school, get the right exam results, and work hard at university. (Opposite) Without a clear aim, it would be impossible to take the necessary steps towards a career in medicine, or any other profession. Note My aim focus is on my answer structure (following the steps), not on grammar or vocabulary. Why Because my priority is to give a long, detailed answer. We don’t have time to think of good words or grammar. Summary of advice for all 3 parts of the speaking test Part 1 - Focus on fluency: try not to hesitate, answer quickly, short and simple Part 2 - Focus on good vocabulary ideas: prepare for 6 main topic area Part 3 - Focus on structure: answer, explain, example, (alternative) IELTS WritingIELTS Writing task 2Lesson 1 The tasksTraining steps Understand the task Break the task into parts Methods, techniques Lots of practice Feedback, measure progress Step 1 - Understand the task - Write an essay Minimum 250 words (there is no maximum) 40 minutes Universal topics (family, health, education, work…) 4 question types Four scoring criteria (focus on the first 3) Task response (have you answer the question?) Coherence and cohesion (is your essay well organised, logically written and easy to follow?) Vocabulary (‘lexical resource’) Grammar (‘grammatical range and accuracy) Step 2 - Break the task into parts 250 words 4 paragraphs about 13 sentences Introduction: 2 sentences Two main paragraphs: 5 sentences each Conclusion: 1 sentence Timing (40 minutes) Planning: 10 minutes Introduction: 5 minutes Main body: 20 minutes Conclusion: 5 minute Lesson 2 IntroductionMethod (2 sentences) introduce the topic (paraphrase what the question is saying) give a general answer Four types of question Discussion Opinion Problem and solution Two-part question Type 1 - DiscussionQuestion: Some people think that it is more effective for students to study in groups, while others believe that it is better for them to study alone. Discuss both views and give your own opinion.Plan: Topic - study in groups or alone; Answer - sometimes better alone, usually better in a groupAnswer: People have different views about the effectiveness of group study as opposed to working alone. While there are some benefits to studying independently, I believe that group work is usually more productive. Type 2 - OpinionQuestion: Some people believe that unpaid community service should be a compulsory part of high school programmes. To what extents do you agree or disagree?Plan: Topic - community service for all teenagers; Answer - 3 choices: agree, disagree, or balanced opinion (when possible)Answer: It is sometimes argued that high school students should be made to do some work in their local communities. (Agree) I completely agree that this kind of scheme would be a good idea. (Disagree) In my opinion, it would be wrong to force teenagers to do any kind of unsalaried work. (Balanced opinion)(not fitting here, but to mention both sides) While I disagree with the idea of making such programmes compulsory, I do believe that voluntary community service could benefit young people. Type 3 - Problem and solutionQuestion: Many criminals reoffend after they have been punished. Why do some people continue to commit crimes after they have been punished, and what measures can be taken to tackle this problem?Plan: Topic - crimes reoffend; Answer - several reasons, a variety of measures (governments, communities)Answer: It is true that punishments do not always deter criminals from committing more crimes. There are various reasons why offenders repeatedly break the law, but governments could certainly take steps to address this issue. Type 4 - Two-part questionQuestion: As most people spend a major part of their adult life at work, job satisfaction is an important element of individual well-being. What factors contribute to job satisfaction? How realistic is the expectation of job satisfaction for all workers?Plan: Topic - job satisfaction; Answer - several factors, unrealistic / impossibleAnswer: Work plays a central role in our lives, and we would all like to feel fulfilled professionally. While a variety of factors may lead to job satisfaction, it would be unrealistic to expect everyone to be happy at work. Summary A short introduction is better 2 sentences in 5 minutes (topic + answer) Lesson 3 Main body paragraphs4 paragraph essay 2 main body paragraphs 5 sentences in each 90 to 100 words each 2 methods (ideas, vocabulary, planning)How to write a main paragraph - 2 types Firstly, Secondly, Finally: advantages, disadvantages, problems, solutions Idea, Explain, Example: one idea, a reason, an opinion Type 1 - Firstly, Secondly, FinallyQuestion: Some people believe that unpaid community service should be a compulsory part of high school programmes. To what extents do you agree or disagree?3-minute plan: (0) disagree for several reasons; (1) school timetable is full, no time for community service; (2) students work in other subjects would be affected; (3) teenagers might not want to do it (reluctant, no motivation)Answer: There are several reasons why I would argue against having compulsory community service for secondary school students. Firstly, the school curriculum is already full with important academic subjects, such as maths, science and languages. For example, I remember having an extremely busy timetable when I was at high school, and it would not have been possible to add to it. Secondly, students’ performance in other subjects would be affected if valuable study time were taken by charity work nor neighbourhood improvement schemes. Finally, I believe that teenage students would be reluctant to take part in any programme of obligatory work, and this could lead to poor motivation and even bad behaviour. Summary - Try to write 5 sentences sentence 1 - Topic sentence sentence 2 - Firstly (sentence 5 - explain more, or add example) sentence 3 - Secondly sentence 4 - Finally Remember Linking words do not help your ‘vocabulary’ score (Firstly, Secondly, Finally, For example) Examiners want to see ‘topic vocabulary’ (compulsory community service, school curriculum, academic subjects, extremely busy timetable, students’ performance, valuable study time, charity work or neighbourhood improvement schemes, reluctant, obligatory work, poor motivation) Type 2 - Idea, Explain, ExampleQuestion: Some people believe that unpaid community service should be a compulsory part of high school programmes. To what extents do you agree or disagree?3-minute plan: (0) voluntary (not compulsory) community service is positive; (1) students more motivated if they can choose; (2) gain work experience, self confidence, skills; (3) good for CVs, career, university admissions, employersAnswer: On the other hand, the opportunity to do voluntary community service could be extremely positive for high school students. By making these programmes optional, schools would ensure that only motivated students took part. These young people would gain valuable experience in an adult working environment, which could help to build their self confidence and enhance their skills. Having such experience and skills on their CVs could greatly improve school leavers’ career prospects. For example, a period of voluntary work experience might impress a university admissions officer or a future employer. Summary - Try to write 5 sentences sentence 1 - Idea sentence 2 - Explain (2 or 3 sentences, + sentence 4, 5) sentence 3 - Example Remember Linking words do not help your ‘vocabulary’ score (On the other hand, these programmes, These young people, their, such experience and skills, For example) Examiners want to see ‘topic vocabulary’ (opportunity, voluntary community service, programmes optional, ensure that only motivated students took part, gain valuable experience, adult working environment, build their self confidence, enhance their skills, school leavers’ career prospects, impress a university admissions officer or a future employer) Lesson 4 Conclusions2 easy ‘rules’ never write anything new (simply repeat or summarise what you’ve already said) one sentence is enough (repeat, summarise) Conclusion technique Paraphrase the answer that you gave in your introduction Examples of how to deal with the 4 types of IELTS writing task 2 question(1) Discussion (+ opinion)Question: In many cities the use of video cameras in public places is being increased in order to reduce crime, but some people believe that these measures restrict our individual freedom. Do the benefits of increased security outweigh the drawbacks?Introduction: It is true that video surveillance has become commonplace in many cities in recent years. While I understand that critics may see this as an invasion of privacy, I believe that there are more benefits than drawbacks.Conclusion: In conclusion, I would argue that the advantages of using video security systems in public places do outweigh the disadvantages.(2) OpinionQuestion: Families who send their children to private schools should not be required to pay taxes that support the state education system. To what extent do you agree or disagree with this statement?Introduction: Some people believe that parents of children who attend private schools should not need to contribute to state schools through taxes. Personally, I completely disagree with this view.Conclusion: In conclusion, I do not believe that any financial concessions should be made for people who choose private education.(3) Problem and solutionQuestion: In the developed world, average life expectancy is increasing. What problems will this cause for individuals and society? Suggest some measures that could be taken to reduce the impact of aging populations.Introduction: It is true that people in industrialised nations can expect to live longer than ever before. Although there will undoubtedly be some negative consequences of this trend, societies can take steps to mitigate these potential problems.Conclusion: In conclusion, various measures can be taken to tackle the problems that are certain to arise as the populations of countries grow older.(4) 2-part questionQuestion: There are many different types of music in the world today. Why do we need music? Is the traditional music of a country more important than the international music that is heard everywhere nowadays?Introduction: It is true that a rich variety of musical styles can be found around the world. Music is a vital part of all human cultures for a range of reasons, and I would argue that traditional music is more important than modern, international music.Conclusion: In conclusion, music is a necessary part of human existence, and I believe that traditional music should be given more importance than international music. Conclusion sentences one sentence no new information paraphrasing to show variety Lesson 5 PlanningSpend 10 minutes planning your essay (3 step essay plan) Question: Some people think that it is more effective for students to study in groups, while others believe that it is better for them to study alone. Discuss both views and give your own opinion. Step 1 - Read and understand the question highlight / underline keyparts (more effective, to study in groups, study alone, Discuss both views, give your own opinion) Step 2 - Plan your essay structure (4 paragraphs) Introduction: topic + answer (study in groups or alone; sometimes better alone, usually better in a group) Main body 1 (Benefits of studying alone) Main body 2 (Benefits of group study (my view)) Conclusion: repeat answer (both have benefits, but I prefer group) Step 3 - Plan ideas for the two main paragraphs (6 minutes) brainstorm, note down any ideas you have develop ideas in detail (keep asking yourself ‘why’?) think of examples to support your ideas finally, try to group related ideas (number them) [1]Benefits of studying alone [2]concentrate better, no distractions, focus on the task, [3]read books or articles, [5]study at own pace, [3]e.g. when revising for an exam, [4]memories information [1]Benefits of group study [2]more ideas, share knowledge, gather more information e.g. [3]research project, [2]learn from each other, [4]more motivating, responsibility to the group, sense of competition 10-minute essay plan, 3 steps Read and understand the question Plan your essay structure Plan ideas for the 2 main paragraphs Lesson 6 Opinion essayTips It’s about YOUR opinion, not other people Your opinion should be clear from the beginning in the Introduction throughout the essay and repeated again in the Conclusion You can use “I” or “my” (NOT “it is agreed that… BUT “I agree that…) Question: The money spent by government on space programmes would be better spent on vital public services such as schools and hospitals. To what extent do you agree or disagree? Step 1 - Read and understand the question highlight / underline keyparts (money spent by governments, space programmes, public services, you agree or disagree) Step 2 - Plan your essay structure (4 paragraphs) Introduction: Topic - government spending; Answer - agree, public services instead of space projects Main body 1: explain why ‘space’ spending should be stopped Main body 2: explain why public service spending is better Conclusion: spend on services that benefit us all Step 3 Plan ideas for the two main paragraphs (6 minutes)(1) [1]Why space spending should be stopped[4]waste of money when projects fail, [2]expensive (scientists, facilities, equipment), [3]no benefit to normal people, politicians showing power, [4]risk of accidents, deaths e.g. [5]Challenger space shuttle(2) [1]Why public service spending is better[2]cheaper e.g. doctors, teachers police instead of astronauts, [3]public services impact on everyone, [5]reduce poverty, better quality of life, [4]we all use schools, hospitals, police, roads etc. Paragraph 1 - Introduction - Topic = government spending; Answer = agree, public services instead of space projectsGovernments in some countries spend large amounts of money on space exploration programmes. I completely agree with the idea that these are a waste of money, and that the funds should be allocated to public services. Paragraph 2 - Main body 1 - Why space spending should be stoppedThere are several reasons why space programmes should be abandoned. Firstly, it is extremely expensive to train scientists and other staff involved with space missions, and facilities and equipment also come at. a huge cost to the government. Secondly, these programmes do not benefit normal people in our daily lives; they are simply vanity projects for politicians. Finally, many missions to space fail completely, and the smallest technological error can cost astronauts their lives. The Challenger space shuttle disaster showed us that space travel is extremely dangerous, and in my opinion it is not worth the risk. Paragraph 3 - Main body 2 - Why public service spending is betterI believe that the money from space programmes should go to vital public services instead. It is much cheaper to train doctors, teachers, police and other public service workers than it is to train astronauts or the scientists and engineers who work on space exploration projects. Further more, public servants do jobs that have a positive impact on every member of society. For example, we all use schools, hospitals and roads, and we all need the security that the police provide. If governments reallocated the money spent on space travel and research, many thousands of people could be lifted out of poverty or given a better quality of life. Paragraph 4 - Conclusion - spend on services that benefit us allIn conclusion, my view is that governments should spend money on services that benefit all members of society, and it is wrong to waste resources on projects that do not improve our everyday lives. Band 7-9 vocabulary / Topic vocabulary space programmes, exploration, missions projects, travel, research funds should be allocated should be abandoned facilities and equipment come at a huge cost vanity projects for politicians can cost astronauts their lives space shuttle disaster public servants a positive impact on every member of society if governments reallocated could be lifted out of poverty given a better quality of life Lesson 7 Discussion essayQuestion: Some people think a sense of competition in children should be encouraged. Others believe that children who are taught to co-operate rather than compete become more useful adults. Discuss both these views and give your own opinion. Step 1 - Read and understand the question highlight / underline keyparts (competition, co-operate, both views, give your own opinion) Step 2 - Plan your essay structure (4 paragraphs) Introduction: Topic - competition or co-operation?; Answer - benefit of both, co-operation more important Main body 1: why encourage competition Main body 2: why teach co-operation (my view) Conclusion: accept both views, co-operation better Step 3 Plan ideas for the two main paragraphs (6 minutes)(1) Why encourage competition[1]motivation to [2]work harder, be better than other children, [3]self confidence, independent work, faster progress, [4]competitive situations when leave school e.g. job interviews, [5]prepared for adult life(2) Why teach co-operation (my view)[1]co-operation even more important, [2]e.g. at work (teams, follow boss’s instructions, help junior staff), [3]collaboration more useful than winning, [4]better attitude for young people, [5] working together Paragraph 1 - IntroductionPeople have different views about whether children should be taught to be competitive or co-operative. While a spirit of competition can sometimes be useful in life, I believe that the ability to co-operate is more important. Paragraph 2 - Main body 1 - Why encourage competition? (motivation)On the one hand, competition can be of great source of motivation for children. When teachers use games or prizes to introduce an element of competitiveness into lessons, it can encourage children to work harder to outdo the other pupils in the class. This kind of healthy rivalry may help to build children’s self confidence, while punishing them to work independently and progress more quickly. When these children leave school, their confidence and determination will help them in competitive situations such as job interviews. It can therefore be argued that competition should be encouraged in order to prepare children for adult life. Paragraph 3 - Main body 2 - Why teach co-operationOn the other hand, it is perhaps even more important to prepare children for the many aspects of adult life that require co-operation. In the workplace, adults are expected to work in teams, follow instructions given by their superiors, or supervise and support the more junior members of staff. Team collaboration skills are much more useful than a competitive determination to win. This is the attitude that I believe schools should foster in young people. Instead of promoting the idea that people are either winners or losers, teachers could show children that they gain more from working together. Paragraph 4 - Conclusion - accept both views, co-operation betterIn conclusion, I can understand why people might want to encourage competitiveness in children, but it seems to me that a co-operative attitude is much more desirable in adult life. Band 7-9 vocabulary competition / co-operation, competitive, co-operative, co-operate, competitiveness a spirit of competition a source of motivation introduce an element of competitiveness outdo other pupils, healthy rivalry build self confidence, determination aspects of adult life superiors, junior members of staff team collaboration skills attitude that schools should foster promoting the idea a co-operative attitude is more desirable Lesson 8 Problem and solution essayQuestion: In many countries schools have severe problems with student behaviour. What do you think are the causes of this? What solutions can you suggest? Step 1 - Read and understand the question highlight / underline keyparts (schools, student behaviour, causes, solutions) Step 2 - Plan your essay structure (4 paragraphs) Introduction: Topic - student behaviour in schools; Answer - variety of reasons, steps can be taken to tackle the problem Main body 1: causes of bad student behaviour Main body 2: my suggested solutions Conclusion: summarise the problem and steps Step 3 Plan ideas for the two main paragraphs (6 minutes)(1) [1]Causes of bad student behaviour[2]parents not strict (too lenient), [3]children don’t accept teachers’ instructions or school rules, [4]teachers’ fault, no control, bad classroom management, [5]influence of celebrities who are a bad example(2) [1]My suggested solutions[2]parents set rules for children, [3]use punishments, actions have consequences, [4]schools train teachers and parents, discipline techniques, better communication, [5]famous people act as role models Paragraph 1 - IntroductionIt is true that behaviour of school pupils in some parts of the world has been getting worse in recent years. There are a variety of possible reasons for this, but steps can definitely be taken to tackle the problem. Paragraph 2 - Main body 1 - Causes of bad student behaviourIn my opinion, three main factors are to blame for the way young people behave at school nowadays. Firstly, modern parents tend to be too lenient or permissive. Many children become accustomed to getting whatever they want, and they find it difficult to accept the demands of teachers or the limits imposed on them by school rules. Secondly, if teachers cannot control their students, there must be an issue with the quality of classroom management training or support within schools. Finally, children are influenced by the behaviour of celebrities, many if whom set the example that success can be achieved without finishing school. Paragraph 3 - Main body 2 - My suggested solutionsStudents behaviour can certainly be improved. I believe that the change must start with parents, who need to be persuaded that it is important to set firm rules for their children. When children misbehave or break the rules, parents should use reasonable punishments to demonstrate that actions have consequences. Also, schools could play an important role in training both teachers and parents to use effective disciplinary techniques, and in improving the communication between both groups. At the same time, famous people, such as musicians and football players, need to understand the responsibility that they have to act as role models to children. Paragraph 4 - Conclusion - summarise the problem and stepsIn conclusion, schools will continue to face discipline problems unless parents, teachers and public figures set clear rules and demonstrate the right behaviour themselves. Band 7-9 vocabulary steps can be taken to tackle the problem three main factors are to blame parents tend to be too lenient or permissive children become accustomed to limits imposed on them quality of classroom management celebrities, famous people, public figures set firm rules, reasonable punishments play an important role in effective disciplinary techniques responsibility to act as role models face discipline problems Lesson 9 2-part questionQuestion: News editors decide what to broadcast on television and want to print in newspapers. What factors do you think influence these decisions? Do we become used bad news, and would it be better if more good news was reported? Step 1 - Read and understand the question highlight / underline keyparts (News editors decide, What factors, you think, we become, bad news, more good news) Step 2 - Plan your essay structure (4 paragraphs) Introduction: Topic - decisions about news stories; Answer - variety of factors, yes too much bad news Main body 1: Factors that influence news editors Main body 2: Too much bad news, should report more good Conclusion: difficult news choice, more positive Step 3 Plan ideas for the two main paragraphs (6 minutes)(1) [1]Factors that influence news editors[2]interest or attract viewers / readers, [3]inform the public, important issues and events, in the public interest, [4]pressure from owners, promote political views(2) [1]Too much bad news, should report more good[1]accustomed to bad news, [2]war, crime, natural disasters, human suffering, [3]desensitises us, cynical about the world, [4]prefer positive news, e.g. medical workers, volunteers, kindness, [5]news to inspire us Paragraph 1 - IntroductionIt is true that editors have to make difficult decisions about which news stories they broadcast or publish, and their choice are no doubt influenced by a variety of factors. In my opinion, we are exposed to too much bad news, and I would welcome a greater emphasis on good news. Paragraph 2 - Main body 1 - Variety of factors that influence news editorsEditors face a range of considerations when deciding what news stories to focus on. Firstly, I imagine that they have to consider whether viewers or readers will be interested enough to choose their television channel or their newspaper over competing providers. Secondly, news editors have a responsibility to inform the public about important events and issues, and they should therefore priorities stories that are in the public interest. Finally, editors are probably under some pressure from the owners who employ them. For example, a newspaper owner might have particular political views that he or she wants to promote. Paragraph 3 - Main body 2 - Too much bad news, should report more goodIt seems to me that people do become accustomed to negative news. We are exposed on a daily basis to stories about war, crime, natural disasters and tragic human suffering around the world. I believe that such repeated exposure gradually desensitises people, and we become more cynical about the world and more sceptical that we can do anything to change it. I would prefer to see more positive news stories, such as reports of the work of medical staff after a natural disaster, or the kindness of volunteers who help in their communities. This kind of news might inspire us all to lead better lives. Paragraph 4 - Conclusion - difficult news choice, more positiveIn conclusion, it must be extremely difficult for editors to choose which news stories to present, but I would like to see a more positive approach to this vital public service. Band 7-9 vocabulary (topic vocabulary) exposed to bad news welcome a greater emphasis on good news Editors face a range of considerations prioritise stories that are in the public interest under some pressure from the owners promote particular political views become accustomed to negative news natural disasters and tragic human suffering exposure gradually desensitises people cynical and sceptical inspire us all to lead better lives a more positive approach vital public service Lesson 10 Extra help for “Agree or disagree?” questionsAgree, disagree or partly agree Question: The money spent by government on space programmes would be better spent on vital public services such as schools and hospitals. To what extent do you agree or disagree? Paragraph 1 - IntroductionGovernments in some countries spend large amounts of money on space exploration programmes. I completely agree with the idea that these are a waste of money, and that the funds should be allocated to public services. Paragraph 2 - Main body 1 - explain why ‘space’ spending should be stoppedThere are several reasons why space programmes should be abandoned. Firstly, it is extremely expensive to train scientists and other staff involved with space missions, and facilities and equipment also come at. a huge cost to the government. Secondly, these programmes do not benefit normal people in our daily lives; they are simply vanity projects for politicians. Finally, many missions to space fail completely, and the smallest technological error can cost astronauts their lives. The Challenger space shuttle disaster showed us that space travel is extremely dangerous, and in my opinion it is not worth the risk. Paragraph 3 - Main body 2 - explain why public service spending is betterI believe that the money from space programmes should go to vital public services instead. It is much cheaper to train doctors, teachers, police and other public service workers than it is to train astronauts or the scientists and engineers who work on space exploration projects. Further more, public servants do jobs that have a positive impact on every member of society. For example, we all use schools, hospitals and roads, and we all need the security that the police provide. If governments reallocated the money spent on space travel and research, many thousands of people could be lifted out of poverty or given a better quality of life. Paragraph 4 - Conclusion - spend on services that benefit us allIn conclusion, my view is that governments should spend money on services that benefit all members of society, and it is wrong to waste resources on projects that do not improve our everyday lives. Question: Some people believe that hobbies need to be difficult to be enjoyable. To what extent do you agree or disagree? Paragraph 1 - IntroductionSome hobbies are relatively easy, while others present more of a challenge. Personally, I believe that both types of hobby can be fun, and I therefore disagree with the statement that hobbies need to be difficult in order to be enjoyable. Paragraph 2 - Main body 1 - explain why easy hobbies can be enjoyable Paragraph 3 - Main body 2 - explain why difficult hobbies can be fun Paragraph 4 - Conclusion - disagree that difficult hobbies are better Question: Many people say that we now live in ‘consumer societies’ where money and possessions are given too much importance. To what extent do you agree or disagree? Paragraph 1 - IntroductionIt is true that many people critics modern society because it seems to be too materialistic. I agree with this to some extent, but I do not think it is the case that everyone is a victim of consumer culture. Paragraph 2 - Main body 1 - I believe many people do focus too much on money Paragraph 3 - Main body 2 - However, many others are not money oriented Paragraph 4 - Conclusion - partly agree Question: In the last century, the first man to walk on the moon said it was “a giant leap for mankind”. However, some people think it has made little difference to our daily lives. To what extent do you agree or disagree? Paragraph 2 - Main body 1 - no benefit in practical terms (standard of living, health Paragraph 3 - Main body 2 - but it was an inspiring achievement Paragraph 4 - Conclusion - partly agree Lesson 11 SummaryBreak the task into parts introductions main body conclusion planning Four types of question Discussion Opinion Problem and solution Two-part question We need to work on 2 things Exam technique / methods (use this ielts-simon video course) Your general level of English (use ielts-simon blog, books, TV, films, dictionary, newspapers…) IELTS Writing task 1Lesson 1course aims methods and techniques break the task into parts types of question Remember The task is to describe what you see. Write a report. Don’t give opinions. No conclusion. Instead write a summary (the overview) Question types (For type 1, 2,3, 4: numbers - describe, compare, changes / trends) Line graph Bar chart Pie chart Table Diagram - comparing Diagram - process Essay structure - 4 paragraphs Introduction Overview Details Details Why 2 paragraphs for Details? This makes you organise or ‘group’ the information better Paragraph 1 - Introduction - One sentence: Paraphrase the questionParagraph 2 - Overview - 2 sentences: The main, general thingsParagraph 3, 4 - Details Lesson 2 Line graphsLine graphs show numbers changing over a period of timeYou will not see a graph with only one line.You will almost definitely see 2, 3, 4 or 5 linesYour job is to compare the lines, not describe them separately First, make a very general comparison (summary / overview paragraph)Second, compare the lines at specific points (‘details’ paragraphs) you can’t describe everything. Write at least one thing about each line. Question: The graph below shows electricity production (in terawatt hours) in France between 1980 and 2012. Paragraph 1 - Introduction - paraphrase the questionThe line graph compares the amount of electricity produced in France using four different sources of power over a period of 32 year. Paragraph 2 - Overview - 2 sentences, 2 main pointsIt is clear that nuclear power was by far the most important means of electricity generation over the period shown. Renewables provided the lowest amount of electricity in each year. Paragraph 3 - Detail 1 - compare the linesIn 1980, the thermal power stations were the main source of electricity in France, generating around 120 terawatt hours of power. Nuclear and hydroelectric power stations produced just under 75 terawatt hours of electricity each, and renewables provided a negligible amount. Just one year later, nuclear power overtook thermal power as the primary source of electricity. Important tip when describing numbers You can’t write Nuclear was 75 terawatt hours of electricity Nuclear produced 75 terawatt hours of electricity You must write Nuclear power was used to produce 75 terawatt hours of electricity Nuclear power stations produced 75 terawatt hours of electricity Paragraph 4 - Detail 2 - compare the linesBetween 1980 and 2005, electricity production from nuclear power rose dramatically to a peak of 430 terawatt hours. By contrast, the figure for thermal power fell to only 50 terawatt hours in 1985, and remained at this level for the rest of the period. Hydroelectric power generation remained relatively stable, at between 50 and 80 terawatt hours, for the whole 32-year period, but renewable electricity production saw only a small rise to approximately 25 terawatt hours by 2012. Vocabulary: paraphrasing, comparing, describing, changes amount of electricity produced source of / provided / generating means of electricity generation over a period of / over the period shown by far the most important a negligible amount nuclear power overtook thermal power as the primary source of electricity rose dramatically to a peak of by contrast the figure for remained at this level, remained stable saw only a small rise Lesson 3 Bar chartsBar charts can show numbers changing over a period of timeThis type of bar chart is the same as a line graphHowever! bar charts don’t always show time… they often only compare numbersYour job is to compare the bars First, make a very general comparison (summary / overview paragraph)Second, compare specific numbers (‘details’ paragraphs) Question: The chart below shows global sales of the top five mobile phone brands between 2009 and 2013. Paragraph 1 - Introduction - paraphrase the questionThe bar chart compares the number of mobile phones sold worldwide by the five most popular manufactures in the years 2009, 2011 and 2013. Paragraph 2 - Overview - 2 sentences, 2 main pointsIt is unclear that Nokia sold the most mobile phones between 2009 and 2011, but Samsung became the best selling brand in 2013. Samsung and Apple saw the biggest rises in sales over the 5-year period. Paragraph 3 - Detail 1 - comparisons, changes over timeIn 2009, Nokia sold close to 450 million mobile phones, which was almost double the numbers of handsets sold by the second most successful manufacturer, Samsung. Over the following four years, however, Nokia’s sales figures fell by approximately 200 million units, whereas Samsung saw sales rise by a similar amount. By 2013, Samsung had become the market leader with sales reaching 450 million units. Paragraph 4 - Detail 2 - comparisons, changes over timeThe other three top selling mobile phone brands between 2009 and 2013 were LG, ZTE and Apple. In 2009, these companies sold around 125 million, 50 million and 25 million mobile handsets respectively, but Apple overtook the other two vendors in 2011. In 2013, purchases of Apple handsets reached 150 million units, while LG saw declining sales and the figures for ZTE rose only slightly. Vocabulary: paraphrasing, comparing, describing, changes sold worldwide sales figures, purchases most popular, best selling brand, top selling second most successful manufacturer market leader mobile phones, handsets, units brands, manufactures, companies, vendors saw the biggest rises, saw declining sales close to, almost, approximately, around double the number rise by a similar amount respectively overtook the other two vendors Lesson 4 Pie chartsPie charts can show numbers, but they always show percentages Remember the full pie is always 100% Pie charts can show changes over time (e.g. years) But pie charts don’t always show changes over time Your job is to compare the percentages First, make a very general comparison (summary / overview paragraph)Second, compare specific figures (‘details’ paragraphs) Question: The charts below show household spending patterns in two countries between 1980 and 2008. Paragraph 1 - Introduction - paraphrase the questionThe pie charts compare five categories of household expenditure in the UK and New Zealand in the years 1980 and 2008. Paragraph 2 - Overview - 2 sentences, 2 main pointsIt is noticeable that the proportion of spending on food and drink fell in both countries over the 28-year period, while spending on utility bills rose. Also, UK residents spent a significantly larger percentage of their household budgets in leisure than their New Zealand counterparts. Paragraph 3 - Detail 1In 1980, 29% of an average New Zealand household budget went on food and drink, while the equivalent figure for a UK home was 23%. By 2008, expenditure on food and drink had fallen by 4% in New Zealand, and by a full 10% in the UK. By contrast, both countries saw an increase in expenditure on utility bills for the average home, from 27% to 31% in New Zealand and from 26% to 28% in the UK. PS: The same information as the overview, but in more detail Paragraph 4 - Detail 2Leisure activities accounted for the highest proportion of UK household spending in both years, but only the third highest proportion in New Zealand. In fact, in 2008, New Zealanders spent only half as much in relative terms on recreation (17%) as UK residents (34%). In both countries, transport costs and other costs took roughly 15% and 10% of household budgets respectively. Tips Don’t describe each country separately Don’t describe each year separately Compare countries and years together Mention all 5 categories into two groups for the two ‘details’ paragraphs The category called ‘Other’ is not important Don’t write “leisure was 34%”. Write “Households spent 34% of their money on leisure” Vocabulary: paraphrasing, comparing, describing, changes spending, expenditure, spent, costs proportion of spending percentage of household budget the equivalent figure for a UK home fell, rose, saw an increase in by 2008, expenditure had fallen spent a significantly larger percentage than their New Zealand counterparts 29% of an average household budget went on while, by contrast leisure accounted for the highest proportion spent half as much in recreative terms recreation Lesson 5 TablesTables can show any kind of number the same information as a line graph, bar chart or pie chart comparisons changes over time (increase, decrease) a lot of information (too much!) Tip A key skill is ‘selecting’ which information to mention Your job is to select, describe and compare the key numbers First, look for main or general features (summary / overview paragraph) Second, describe specific numbers (‘details’ paragraphs) Question: The table below shows statistics about the top five countries for international tourism in 2012 and 2013 Paragraph 1 - Introduction - paraphrase the questionThe table compares the five highest ranking countries in terms of the numbers of visits and the money spent by tourists over a period of two years. Paragraph 2 - Overview - 2 sentences, 2 main pointsIt is clear that France was the world’s most popular tourist destination in the years 2012 and 2013. However, the USA earned by far the most revenue from tourism over the same period. Paragraph 3 - Detail 1In 2012, 83 million tourists visited France, and the USA was the second most visited country, with 66.7 million tourists. Spain and China each received just under 58 million visitors, while Italy was ranked fifth with 46.4 million tourists. 2013 saw a rise of between 1 and 4 million tourist visits to each country, with the exception of China, which received 2 million fewer visitors than in the previous year. Paragraph 4 - Detail 2Spending by tourists visiting USA increased from $126.2 billion in 2012 to $139.6 billion in 2013, and these figures were well over twice as high as those for any other country. Spain received the second highest amounts of tourist revenue, rising from $56.3 billion to $60.4 billion, followed by France, China and Italy. Interestingly, despite falling numbers of tourists, Chinese revenue from tourism rose by $1.7 billion in 2013. Key skill: selecting information Let’s check to see which numbers were mentioned in the report You can’t mention every number I choose around 10 out of the total 20 numbers in the table Vocabulary: paraphrasing, comparing, describing, changes five highest ranking countries the world’s most popular tourist destination earned by far the most revenue from tourism the second most visited country received… visitors ranked fifth 2013 saw a rise of fewer visitors than in the previous year these figures were well over twice as high as amounts of tourist revenue despite falling numbers saw a rise, increased, rising from, rose by Lesson 6 2 different charts2-chart question These are questions with 2 different charts, which you can’t compare together Your job is to select, describe and compare the key numbers But you don’t need to compare the 2 charts together - you can describe them separately First, look for one main feature i each chart (summary / overview paragraph) Second, describe specific numbers for each chart separately (‘details’ paragraphs) Question: The bar chart below shows the numbers of men and women attending various evening courses at an adult education centre in the year 2009. The pie chart gives information about the ages of these course participants. Paragraph 1 - Introduction - paraphrase the questionThe bar chart compares the numbers of males and females who took four different evening classes in 2009, and the pie chart shows the age profile of these attendees. Paragraph 2 - Overview - 2 sentences, 2 main pointsIt is clear that significantly more women than men attended evening classes at the education centre. We can also see that evening courses were much more popular among older adults Paragraph 3 - Detail 1According to the bar chart, drama, painting and language courses all attracted more women than men to the education centre in 2009. Language classes had the highest number of participants overall, with 40 female and 20 male students, while painting was a popular choice among both genders, attracting 30 female and 25 male attendees. The only course with a higher number of males was sculpture, but this course was taken by a mere 15 people in total. Paragraph 4 - Detail 2Looking at the age profile pie chart, we can see that the majority of people attending evening lessons were over 40 years of age. To be precise, 42% of them were aged 50 or more, and 26% were aged between 40 and 49. Younger adults were in the majority, with only 11% of students aged 20 to 29, and only 5% aged under 20. Vocabulary: paraphrasing, comparing, describing changes attending courses, who took classes participants, attendees, students males and females courses attracted more women a popular choice among both genders significantly more, higher, highest had the highest number, with (+number) was taken by a mere 15 people According to the bar chart Looking at the age profile pie chart the majority of people were in the minority To be precise Lesson 7 2process diagramProcess diagrams show steps or stages in a process manmade process e.g. how glass is made, how a type of food is produced natural cycles e.g. water cycle, life cycle of a butterfly Describing a process is completely different describing a graph, bar chart, pie chart or table Difference no numbers can’t compare anything can’t describe trends (increase, decrease) So, what can we describe? how many steps where the process begins and ends where the process begins and ends each step in the process Language for process descriptions ‘step’ language At the first stage in the process The process begins with Secondly, Finally The second step involves Next, then, after that At the following stage passive verbs people collect the glass → glass is collected Question: Glass recycling processAt the first stage in the process, glass is collected. Active: Next, people sort the glass by handPassive: Next, the collected glass is sorted by hand. Active: The glass passes through a grinding machinePassive: The glass is passed through a grinding machine. / The glass is ground in a machine. Note: maps can also show processes Question: Map showing growth of a city e.g. At the second stage of development, from 1891 to 1950, the city grew in a northerly direction. Question: The diagrams below show how glass containers, such as bottles, are produced and recycled. Paragraph 1 - Introduction - paraphrase the questionThe first flow diagram illustrates the process of glass container production, and the second diagram shows steps in the process of recycling used glass. Paragraph 2 - Overview - 2 sentences, 2 main pointsWe can see that glass is made using three main raw materials, and that the manufacturing process consists of four distinct stages. It requires five steps to turn used glass into new glass products. Paragraph 3 - Detail 1At the first stage in the production of glass, sand, soda ash, limestone and other chemicals are mixed together. Next, this mixture is heated in a glass furnace at approximately 1500°C to produce molten glass. The molten glass can then be shaped by blowing, to create the end products, namely glass containers. Paragraph 4 - Detail 2Glass recycling begins with the collection of used glass products. The collected glass is sorted according to its colour, and then washed in order to remove any impurities. At the fourth stage of recycling, the glass is crushed and melted, and the resulting molten glass can finally be moulded to create new items. Vocabulary: paraphrasing, steps, passive verbs steps / stages in the process of consists of four distinct stages it requires five steps raw materials, end products production, manufacturing turn used glass into new products at the first stage, next, then, begins with are mixed, is heated, can be shaped is sorted according to can be moulded to create are mixed → this mixture collection → the collected glass is melted → the resulting molten glass Lesson 8 comparison diagramComparison diagrams show changes to something e.g. an old design compared to a new design - ‘Before and after’ diagrams The diagrams show changes to a school building over a period of 32 years The maps show an island before and after the construction of facilities for tourists or two alternative designs - ‘Alternative designs’ diagrams The diagrams show different house designs for warm and cold climates or even two alternative locations on a map - ‘Alternative locations’ map The map shows two possible locations for a new supermarket Your job is to compare the diagrams Describe the changes Describe things that don’t change Describe the differences Describe the similarities Question: The diagram below show the existing ground floor plan of a house and a proposed plan for some building work. Paragraph 1 - Introduction - paraphrase the questionThe two pictures compare the current layout of the ground floor of a house with a plan to redesign the same living space. Paragraph 2 - Overview - 2 sentences, 2 main pointsWe can see that the new design proposal involves making a number of changes to the ground floor of the house, mainly in the central hall area. There are no plans to change external walls or entrances. Paragraph 3 - Detail 1The most noticeable change from the existing to the proposed floor plan is that there will no longer be a separate hall area when the building work has been down. This will be achieved by removing the internal wall and door between the hall and living room, along with the current staircase and under-stair storage cupboard. With no separate hall area, the proposed living room will also contain the staircase to the first floor. Paragraph 4 - Detail 2To replace the current straight staircase, a new set of winding stairs will be installed in the corner of the living room. The internal door between the hall and kitchen will also be replaced with double doors connecting the kitchen with the new living room. Finally, the planned building work will also include the installation of some kitchen furniture. Vocabulary: paraphrasing, verbs, description of changes existing plan → current layout proposed plan → plan to redesign design proposal, planned building work there will no longer be this will be achieved by removing will also contain, will also include will be installed, will be replaced the design proposal involves when the building work has been done living space, central hall area, staircase under-stair storage cupboard a new set of winding stairs the installation of some kitchen furniture Lesson 9 SummaryWe have a method introduction overview details paragraphs Six types of question line graph bar chart pie chart table process diagram comparison diagram PS Map questions are the same as diagram questions Some maps are the same as ‘process’ diagrams How do I get a band 9 in IELTS Speaking?Band 5.0 - 6.5 Part 1 memorized answers very long answers off-topic very formal robotic range is limited Part 2 rigidly follow the bullet points run out of ideas use a trick (e.g. just PPF - past, present, future) Part 3 very short answers might not attempt some answers want it to be over Band 7.0 - 9.0 Part 1 feels like a normal conversation answer questions directly naturally developing their answers enough, but not going off-topic Part 2 focus on the main topic speak naturally about the main topic for 2 minutes use the bullet points to help them speak naturally Part 3 attempt every questions lots of developments no problem talking about a range of different topics 雅思词句IELTS Cambridge 4Test 1 Reading Passage 1 tropical 热带的readily 容易地estimate 估计equivalent 相等的tuition 讲授harbour 心怀multifaceted 多面的organised 有组织的conceptual 概念的erroneous 错误的refined 精炼的，优雅的，改进的damp 潮湿的continent 大陆Equator 赤道indigenous 当地的pupil 小学生intrinsic 本质的personalisinglogging 伐木embrace 拥抱，欣然接受imcompatible 有冲突的，不兼容的indication 迹象appreciation 理解arena 圆形运动场plight 困境encounter 遭遇implication 暗示misled 误导sb. be (frequently) confronted with statements about sth.(illustration) to which sb. might readily relate (is the estimate that…)at a rate equivalent to (one thousand football fields) every (forty minutes)sb. harbour(s) misconceptions about sth.sth. be accessible to modificationlittle (formal) information is available about sth.descriptions which are self-evident from the term ‘(rainforest)’sb. raise(s) the idea of (rainforest) as (animal habitats)sth. be (generally) consistent with one’s previous studies ofsb./sth. be shown to be (more sympathetic to animals)place (an intrinsic value) on (animal life)in some cases (this response) embraces (the misconception that) IELTS Cambridge 5Test 1 Listening Section 1 coast 海岸in particular 尤其coach 长途汽车minibus 小型公共汽车coachload 长途汽车团体旅客at most 至多in three weeks’ time 三周后cruise 乘船游览bushwalk 丛林漫步reptile 爬行动物，卑鄙小人more or less the sameprefer A to Bbe free tosit by the hotel poolgo down the beachcourt 球场accommodation package 住宿套餐departure 出发deposit 押金get back to sb. 回电…provisional 临时的 Test 1 Listening Section 2 beware 当心wisely 明智地cot 幼儿床in the budget price rangeverdict 裁决，结论意见the only slight problems with sth. are/were that …brake 刹车trap 困住on the minus sidedrop down 下降hazard 危险the negatives for sth. were quite minordetached 单独的discontinue 终止presentrusted 生锈的bent 弯折的curved 弯曲的rounded 球形的edging 饰边sharp 尖的，锋利的 Test 1 Listening Section 3 diploma 毕业文凭prospectus 简介financial circumstances 财务状况administration section 行政科Personnel Management 人事管理take a year off 休假一年keen 热切的get some more qualifications 获得更多的资格证书without taking too much time away from worktake unpaid leave 无薪休假have two other possibilitiesmodular 模块化的module 模块a module takes a term = each module lasts for one term, say, about twelve weeks at a timethe work is very intensive = you can study in a much more intensive waywork on a topic in depth = choose a topic to work in more depthit would be up to youseminar 研讨会discussion workshop 讨论会tiring 累人的base sth. on sth. 把某事物建立在某事物上talk sth. over with sb. 与某人讨论某事 Test 1 Listening Section 4 socialism 社会主义capitalism 资本主义unwilling toessential instruction 基本指令have pretensions to (doing) sth. 自诩/标榜…save up 攒钱people might question a lot of the assumptions contained in those statementsit takes a surprisingly large amount of the household budgetthe other main priority for men when saving money is their retirementdisturbing 令人不安的throughout the worldspouse 配偶the high divorce rates are creating a poverty cycle for womenfor women it takes a crisis to make them think about their future financial situationthis is the very worst time for anyone to make important decisionsin one’s early twentiesdeal with financial affairs = deal with economic situationpension 养老金，退休金，抚恤金in professional position 处于职业地位there are sign thatget oneself properly informaed 使某人获得适当的信息set up initiative 设立立法提案程序put a high proportion of their savings in low-risk investmentsprofitable 有利可图的，有益的take some well-informed risksincreasing proportion of elderly women in the population Test 1 Reading Passage 1 Jonhson’s Dictionary scholarly 学术的contemporary 当代的draw 抽出，取用subtlety 精巧，微妙originality 原创性pension 退休金，养老金，抚恤金circumscribe 限制conquer 征服lexical 词汇的heyday 全盛期intensely practical 非常实用establishment 机构single-handed 独自一人的；独自一人地inn 小旅店square 广场，正方形，平方workshop 车间，研讨班biographer 传记作者garret 阁楼counting house 账房rickety 摇晃的heroic 英勇的，史诗的，坚决的synthesis 综合体predecessor 前任，被替代者adopt 采纳precedent 先例leading 一流的lexicographer 词典编纂者perpetual monument 永久纪念碑eccentricity 古怪，怪癖masterpiece 杰作，典范，代表作orthography 拼写体系，拼写学whilst = whileimmense work 艰巨的工作cornerstone 基石esteem 尊重take into account 考虑到draw on 利用take on 雇用help with (doing) sth. 帮助in installments 分期地to hand 在手边，在附近as to 关于convey an impression of 留下…的印象the very model 当之无愧的楷模as adj. in his own times as in ours 在他那个时代和我们这个时代一样…up until 一直到settle arguments about 平息关于…的争论fit up 装潢，配备，构陷station oneself on a chair / at the window / behond the door 待在某处a chaos of 杂乱一团的not seriously rivalled for over a century 超过一个世纪无可匹敌after many vicissitudes 历经沧桑变迁display the analogy 陈列类比regulate the structures 调整结构ascertain the signification 探明含义A, together with B, …prevail upon sb. to do sth. 劝说某人做某事become the Johnson of folklore 成为民间传说中的Johnsona time limit = deadline 截止日期in excess of = over 超过immediately hailed as = instantly recognised as 很快被誉为bring stability to = confer stability on 赋予稳定性A be granted sth. by B = A offer B sth.growing importance = risea desk running down the middle = a central desksubtleties of meaning = many different shades of meaning with little assistance of the learned, and without any patronage of the great;not in the soft obscurities of retirement, or under the shelter of academic bowers,but amidst inconvenience and distraction, in sickness and in sorrow. Test 1 Reading Passage 2 Nature or Nurture? fascinating 迷人的disturbing 令人不安的behavioural psychology 行为心理学from all walks of life 各行各业subjects feel a personal distaste for sth. 实验对象对某事感到厌恶be called upon to perform the actions 被要求执行这些动作pupil 小学生experimental set-up 实验布置ranging from … to … in steps of … each 范围从…到…每段间隔为…administer punishment 执行处罚increase in 在…方面增长severity 严重性successive 连续的supposed 误以为的hire 雇用simulate doing sth.emit a spectrum of groans 发出一阵呻吟scream 尖叫writhe 扭动together with 连同an assortment of statements 各种各样的陈述expletive 咒骂语denounce sb. to do sth 告发某人做某事denounce sb. as … / for doing sth. 谴责某人…call for 要求as per = according tounfold 展开，披露bring on adj. punishmentsbalk at sth. 回避carry on with the experimentbe reluctant to 不愿意proceed 继续for the sake of 为了follow through the procedure to the end 按照程序进行到底in the face of 面对strong personal and moral revulsion against … 对…的强烈的个人和道德厌恶carry out the experiment 实施实验psychiatrist 精神病医生average percentage of people in an ordinary population who 普通人口中…的人的平均占比overwhelming consensus 压倒性的共识virtually 差不多anticipate 预料a lunatic fringe of about one in 1,000 千分之一的极端分子in repetitions of the experiment 重复实验obedient 顺从的account for 解释…的原因vast discrepancy between 巨大差异rational 理性的in the comfort of study 在书房的安逸中pressured 受到压力的flustered 慌张的cooperative 配合的，合作的one’s first inclination might be to 人的第一倾向是agression instinct = aggressive instinct 攻击本能genic 基因的genetic 基因的，遗传的genetical 基因的，遗传的，起源的discharge the pent-up primal urge onto sb. by doing sth. 通过做某事在某人身上释放被压抑的原始冲动hard-core 骨干的，中坚力量的sociobiology 社会生物学sociobiologist 社会生物学家biologist 生物学家psychologist 心理学家anthropologist 人类学家even go as far as to 甚至于wouldn’t go as far as to 还不至于advantageous trait 优势性状in one’s struggle against the hardship of lifeplain 平原cave 洞穴make-up 组成remnant 残迹an alternative to this notion of 对这个概念的可能的选择see … as a result of …see … in a larger contextbenevolent to 善意的psychological laboratory 心理实验室a strong claim to legitimacy 强烈声称合法性evoke trust and confidencedoing sth, which in isolation appears adj., acquires a completely different meaning when placed in this settingunique personality 独特的个性personal and moral code 个人和道德准则institutional structure 体制结构individual property 个人特性loyalty 忠诚self-sacrifice 自我牺牲discipline 纪律surrender … to … 交出service 行政部门malevolent systems of authority 邪恶的权威体系radically different 截然不同的polar 截然对立的forgo 放弃personal responsibility 个人责任institutional authority figure 机构权威人物plausible 貌似合理的，有眉有眼的in essence 本质上hard-wired 遗传的dictate to 强加于，向…发号施令put another way = or put it another way = in other wordselucidate 阐明persuade sb. to do sth. = convince sb. to do sth. 说服某人做某事instruct sb. to do sth. 吩咐某人做某事 Test 1 Reading Passage 3 The truth about the Environment environmentalist 环境保护主义者develop a hit-list of one’s main fearsbe ever growing 一直增长become extinct in vast numbers 大量灭绝a quick look at the facts shows a different pictureas has so often been predicted 正如人们经常预测的那样exaggerate 夸大transient 短暂的associated with the early phases of industrialisation = linked to industrialisationrestrict economic growth = slow down economic growthglobal warning does appear to be a phenomenon that is going to extend well into our futurepose a devastating problem 造成毁灭性的麻烦inappropriate response to 对…的不当反应opinion polls 民意调查many people nurture the belief that 许多人认为…disjunction between perception and reality 感觉与现实的脱节lopsidedness built into scientific research 科学研究中根植的片面性create an impression thatmany more potential problems exist than is the case 存在的潜在问题比实际情况多得多understandably 可以理解地overstate one’s arguments 夸大其词issue a press release 发布新闻稿be run overwhelmingly by selfless folk 绝大多数由无私的人管理nevertheless 尽管如此… share many of the characteristics of … …与…有许多共同的特点lobby group 游说集团apply the same degree of scepticism to … as they do to … 对…采取对…同等的怀疑态度doing sth. be instantly seen as adj. …一目了然self-interested 自私的altruistic 无私的impartial 公正的do more harm than good 弊大于利confusion 困惑，混乱，窘迫，不确定curious about 对…好奇significant distortions of perception 感知的重大扭曲one’s encounter with 邂逅，遭遇climatic phenomenon 气候现象be accused of 被指控be blamed on 归罪于impute blame to 归咎于attribute a fault to 归咎于wreck 毁坏allergy 过敏ski-slope 滑雪场bulletin 简报meteorological society 气象学会the costs amount to some … = at a total cost of around … 花费总计约(US $5,000 billion)estimated 估计的expected 预料的endless rise in the amount of … …的数量不断增加stuff everyone throws away = wasterun out of places to dispose of … 没有地方可处理…take up 占用，耗费cause the planet to warmthe best estimates are that 最好的估计是cause considerable problems 造成相当大的问题intuition 直觉drastic 极端的radically 根本地adaptation to 应对…postpone = delay 推迟merely 仅仅pressing problem = urgent problem 紧迫问题provide universal access to sanitation 提供公共卫生的普遍机会/通道crucial = essential to (doing) sth/for sth. 去做某事物/对于某事物至关重要It may be costly to be overly optimistic - but more costly still to be too pessimisticoptimistic = sanguine 乐观的pessimistic = dim 悲观的take a pessimistic/dim view of 对…不赞成/怀疑/没有好感mass media 大众传媒oppose 反对increase in line with … growth 随着…的增加而增加 Test 2 Listening Section 1 fill out some forms 填写一些表格bank statement 银行对账单facility 特色服务，特别功能fine 罚款booklet 小册子renew 延长期限，续订free of charge 免费for external members like yourselfmake a nominal charge 象征性收费thereafter 之后advisable 明智的at a time 每次photocopying 影印5p a sheet 5便士一张counter 柜台I’ll be along later this week 我这周晚些时候会来 Test 2 Listening Section 2 charity 慈善机构Ecuador 厄瓜多尔I want adventurejoin a voluntary organisationcarry out land surveys 进行土地调查the project came to an end after five yearsrural area 农村地区everyone else 其他每个人I realised doing sth meant…carpenter 木匠craftman 手艺人in three-kilometer radius 方圆三公里sell sth. for 5% of the normal price 以正常价格的5%出售某物a full container of 整集装箱you wouldn’t recognise it as the same place 你不会认出它是同一个地方run out of money 花光钱了can’t meet its overheads 不能满足经常性开支have containers of bikes ready to sendwe managed to ensure…but other problems carried on for several monthswe invest fifteen of the seventy-five-thousand-pond prize money to help do sth.raise our profiles 提升我们的形象strip down 拆卸，剥去which are expensive to buya consignment of bikes 一批自行车the event was to raise public awareness 这项活动的目的是提高公众意识 Test 2 Listening Section 3 the rest of the groupI hope that you got a lot out of ittutor 教师，导师，助教，班主任tutorial 个别指导feedback session 反馈会议get to know 认识，审悉do not usually have much to do with 通常没有太多的关系maintain the contact 保持联系from the point of view of 从…的角度来看follow the instructions 按照说明that was very good practice for mespeak at natural speeduse a lot of slang 使用大量俚语I’m glad it helpedWere there any other benefits?I’ve never done anything with a group beforefind ways of doing sth. 找到做某事的方式cooperate 合作compromise 妥协persuade 说服do it all over againdecide onshould have agreed about thatwe were always late with everythinginexperienced 缺乏经验you’ll have an opportunity to put into practice what you’ve learnt this time Test 2 Listening Section 4 hostile 不友善的，有敌意的uninhabited 无人居住的on a permanent basis 长期地the ultimate survival contest 终极生存竞赛a wilderness of great beauty 美丽的荒野a place of extremes 极端的地方continent 大陆over fifty-eight times the size of the UK 面积超过英国的58倍ice-cap 冰冠snowfall 降雪（量）fall unbelievably into the category of “XX” 难以置信地落入“XX”的范畴iceberg 冰山break off 中断，隔绝all-year-round 终年self-contained 自给自足的to ensure everyone keeps fit in their spare timesatellite link 卫星链路ice-shelf 冰架sledge 雪橇snow build-up 积雪cause enormous problems forcrash 使碰撞，使发出嘎吱声，擅自闯入come up with a remarkable solutionextendable 可伸缩的，可延期的polar climate 极地气候polar explorer 极地探险家undertake heavy physical work 承担繁重的体力劳动kilocalorie 千卡carbohydrate 碳水化合物fat 脂肪ration for 配给量fieldwork 实地考察present a additional problemcompact 小巧紧凑的freeze-drying 冷冻干燥保存make a large saving in weight 大大减轻了重量being at the cutting edge of science 处于科学的前沿the most crucial field of study 最重要的研究领域in whatever capacity 以任何身份fascinating 迷人的vital 必不可少的，充满生机的have profound effects on 对…有深邃的影响ocean current 洋流ozone layer 臭氧层ultra-violet radiation 紫外辐射ice-sheet 冰盖administrative and technical positions 行政和技术职位vacancy for 空职 Test1 2 Reading Passage 1 Bakelite - The birth of modern plastics Belgian 比利时的，比利时人patent a revolutionary new synthetic materialbe of enormous technological importanceeffectively launch the modern plastics industrybe derived from natural sources 源于自然资源semi-synthetic 半合成品synthetic 合成的；合成品chemical reaction 化学反应natural substance 天然物质synthetic plastics are chemically engineered from the constituents of coal or soil 合成塑料由煤或土的化学成分制成thermosetting plastics cannot revert to their original viscous state 热固性塑料不能恢复到原来的粘性状态for ever 永远have the (dubious/statistical) distinction of 有…的特质impetus 推动力immense technological progress in the domain of chemistry 化学领域的巨大技术进步coupled with = together withpragmatic 务实的substitute 替代品dwindling 逐渐减少/变小的tortoiseshell 龟甲ivory 象牙embark on research into phenolic resins 开始从事酚醛树脂的科学研究sticky 黏糊糊的phenol 酚carbolic acid 石炭酸aldehyde 醛formaldehyde 甲醛acetaldehyde 乙醛volatile fluid 挥发性液体alcohol 乙醇，酒精abandoned the subject 放弃课题make one’s fortune 发财amass a fortune 积累财富photographic paper 相纸manufacture sth. on an industrial scale 按工业规模生产某物make possible its preparatoin on a commercial basis 使其商业制备成为可能one’s major contribution to the field is not so much (doing) sth., but rather (doing) sth.outline a three-stage processunder vacuum 在真空下kettle 水壶，锅resin 树脂soluble 可溶的malleable 有延展性的be allowed toshallow tray 浅盘be broken up and ground into powder 被破碎然后磨成粉末be ground up 被碾碎filler 填料woodflour 木屑asbestos 石棉cotton 棉花moisture resistance 防潮性catalyst 催化剂compound 化合物ammonia 氨，氨水granular powder 粒装粉末a vast range ofthe heated Bakelite was poured into a hollow mould of the required shape and subjected to extreme heat and pressurehollow mould 凹型模earring 耳环television set 电视机be governed to a large extent by the technical requirements of the moulding process… not … so that … 不是要…使得…taper towards 朝…方向上逐渐变窄/小be moulded in separate pieces 分块模制flow evenly and completely into the mould 均匀、完整地流入模具sharp corner 尖角prove impractical 证实为是不切实句的give rise to = lead to 造成，引发，导致streamlined 流线型的make the most efficient use of 最有效地利用be treated with disdain = be despised 被鄙视enjoy an unparalleled popularity 无比流行lasted throughout … 持续了…industrial expansion 工业扩张non-porous 无孔的heat-resistant 隔热的kitchen goods 厨房用品be promoted as germ-free and sterilisable 被推广为无菌和可消毒的产品seize on its insulating properties 大为关注其绝缘性质relish = enjoy 享受dazzling array of shades 耀眼的色彩wood tones 木头色调drab browns 单调的棕色fall from favour 失宠renaissance 复兴，文艺复兴renewed 重新开始的 ，重燃的marketplace 集市dedicated 献身的，狂热追逐的appreciate 欣赏originality 独创性innovative 革新的facility 特别装置，设施 Test 2 Reading Passage 2 What’s so funny? the punchline is silly yet fitting 笑点很蠢但很恰当tempt 引诱strike 击打，碰撞，侵袭，引起，使突然想到，给…某种印象，打动，钻探到，达成，摆出，铸造，拆卸，降下，生根，急拉钓线把…勾住deeply mysterious 神秘莫测的pointless 无意义的dub/call A B = A be described as B 把A称为Breflex 反射动作，本能反应unique in that it serves no apparent biological purpose 独特之处在于它没有明显的生物学用途theories about humour have an ancient pedigree 关于幽默的理论由来已久humour is simply a delighted feeling of superiority over overs 幽默只是一种比别人优越的愉快感觉joke-telling relies on building up a psychic tension which is safely punctured by the ludicrousness of the punchline 讲笑话依赖于建立一种精神紧张，这种紧张感被笑话的滑稽性安全地戳穿settle on 选定some version of 某种形式的jokes are based on a reaction to or resolution of incongruity 笑话基于对不合时宜的反应或消解computational linguist 计算语言学家language understanding and reasoning in machine 机器学习中的语言理解与推理there is no single format for… …没有单一的格式nonsense 无意义的话，胡闹conceptual shift 概念转变comedian 喜剧演员unexpected 出乎意料的interpretation 解释，口译apt 恰当地，易于的，聪明的semantic fit 语义适应buzz 嗡嗡声，叽叽喳喳，谣言，打电话，愉悦viewed from this angle 从这个角度看a form of creative insight 一种创造性洞察力a sudden leap to a new perspective 向新视角的飞跃appeasement 平息，安抚ultrasonic 超声波的squeak 嘎吱声，侥幸逃脱scuffle 扭打，冲突nasty 肮脏的，恶意的，危险的，严重的chimpanzee 黑猩猩gaping 张开的，裂开的，目瞪口呆的panting 气喘吁吁的mutate into 变成social situation 社会情境cognitive 认知的trigger 触发，引起instinctual 本能的fairground 露天游乐场tickle 使发痒，使高兴flag 悬旗装饰，标示，用标记标明tap into 利用，开发expressive machinery in our brains 我们大脑中的表达机制motor circuit 动力电路vocalisation 发声，话语表达functional magnetic resonance imaging 功能性核磁共振成像magnetic field 磁场radio wave 无线电波oxygenated blood 氧合血reasoning 推理，论证appreciate 感谢，意识到，欣赏prefrontal cortex 前额叶皮质light up 照亮，点燃，使发亮；发光，开始吸烟，面露喜色temporal lobe 颞叶consistent with 与…并存（一致）rouse 唤醒，激起；醒来spring to life 焕发活力orbital prefrontal cortex 皮层patch 补丁，眼罩，饰颜贴片，小片，小片土地，地盘，时期tuck 把…塞进，为…掖好被子，在…上打褶arousal 激动，醒来in the blink of an eye 转眼之间abrupt change 陡变orbital cortex 额眶部皮质sub-cortical arousal apparatus 皮层下觉醒器centres of metabolic control 代谢控制中心warm-blooded animals 恒温动物in arousal 觉醒snap into place 就位there is a shudder of pleased recognition 人们不寒而栗地高兴地承认了这一点pleasurable 愉快的milk 挤…的奶，抽取，消耗，榨取disgusting 令人厌恶的frightening 骇人的fine 极好的，很好的，（作反语），精美的，优雅的，高尚的，晴朗的，细微的，纤细的，颗粒细小的，细密的，纯的outlook 观点，前景，景色evolutionary accident 进化事故psychologist 心理学家distorted mirror 扭曲镜perceptual 感知的analytical 分析的lingual 语言的have a (pretty) good handle on 能够很好地处理above-average 超过平均水平的 Test 2 Reading Passage 3 The birth of scientific english be dominated by 受…支配reach a wide international audiencegiven… 鉴于…prominence 显赫，显眼intellectual 知识分子The European Renaissance 欧洲文艺复兴revival 复元，复兴，复苏，重演emergent nation state 新兴民族国家developed competitive interest in world exploration and the development of trade 对世界探索和贸易发展产生了竞争性兴趣magnetism 磁性，吸引力cartography 制图学astronomy 天文学in relation to 与…有关adopt 采纳publicise 宣传，推介with enthusiasm 热情地the Royal Society 英国皇家学会promote empirical scientific research 促进实证科学研究create new national traditions of science 创造新的民族科学传统in the initial stages of the scientific revolution 在科学革命的最初阶段encyclopaedia 百科全书treatise 论文a treatise on sth. 关于某研究课题的论文a scholarly treatise = an academic treatise 学术论文it is simply a matter of… 这仅仅是一个关于…的问题whereas 然而，鉴于perversely 任性地preliminary idea 初步设想put into the public domain sth. 将某物公之于众intellectual property rights 知识产权… was a feature of the period …是这一时期的一个特点humanist notion 人文主义观念rational 理性的，合理的，神智清楚的common practice 风尚，常例，普遍的做法proof 证据，验证，证明，校样，照相毛片，标准酒精度in cipher 以暗号/密码in obscure languages 用晦涩的语言precisely because 正因为clung the most keenly to 紧紧抓住may have been to do with 可能是因为impersonal 客观的，冷淡的，平常无奇的，无人称的hypothetical 假设的entity 实体possess an interest in 对…感兴趣become engaged in 从事proposal 提议，建议，求婚did a great deal to… 为…做了很多工作foster 培养，抱有，养育，寄养publish monographs in English 出版英文专著curator 馆长narrative 叙述的transcript 抄本，成绩单oral demonstrations 口头说明inaugurate 为…举行开幕式，使…就职，开创a new genre of 一种新的体裁formative period 形成期momentum 动量，动力as opposed to 与…相对specialised 专门的，特化的professional 职业性的institute 开始实行discipline 学科 Test 3 Listening Section 1 I’m thinking of doing sth.I’d like some adviceI haven’t really made up my mindlitre 升get a few more details 了解更多细节gear change 换挡manual gear 手动档automatic gear 自动档give some thought to 考虑一些or so 左右the cash price is going to be somewhere in the region of seven and a half thousandbe in a position to 能够in a moment 一会儿，马上part exchange 以旧换新get hold of 找到某人get back to you 回复你metallic grey 银灰色resonable 尚好的 Test 3 Listening Section 2 rural setting 乡村环境something that will certainly be of interest to youA is just 35 minutes from B A距离B仅有35分钟路程have a strong research capacity 有很强的研究能力we came 7th out of 101 universities in last year’s research assessment 在去年的研究评估中，我们（学校）在101所大学中排名第七government body 政府机构there is one further point to make 还有一点需要说明 have unusually close relationships with 与……关系异常密切sales talk 推销游说take a sip of coffee 喝一口咖啡now if 如果现在occasionally 偶尔postal 邮政的hold-up 停顿，抢劫reference = referee 推荐人reassure sb. about sth. 消除某人对某事的担忧reassure sb. that… 向某人保证…things are moving along 事情进展顺利put…in contact with… 使…与…联系phone sb. up 给某人打电话liaise with sb. 与 某人联系liaise between A and B 做A和B间的联系人get an objective opinion of 产生对…客观的看法academic atmosphere 学业风气leisure facilities 体闲设施independent learning is the norm 自主学习是常态something like 大约，类似give priority in the allocation of resident places to three categories 优先分配三类学生的宿位visiting student 访问学生exchange student 交换生postgraduate student 研究生doctoral candidate 博士研究生demand exceeds supply 供不应求campus accommodation 校内住宿live off-campus = live outside the university 校外住宿accompany 陪同 ，伴随 ，伴奏snap up 抢购accommodation officer 宿舍管理员get in touch with 和…取得联系on one’s behalf 代表某人I wish I could speak your language half as wellmake little or no allowance for 很少或根本不考虑invite further question 请进一步提问with regard to 关于，说起 Test 3 Listening Section 3 it was the day after … 是…的后一天give comments on the following aspects of 就以下方面提出意见it seemed dead easy 这似乎容易死了all of a sudden 突然地we get a whole load of work, reading to do and essay and things 我们有一堆工作要做…even 均匀地，平稳的course delivery 课程实施I suppose soI don’t think it was all that wonderful 我不认为这一切都那么美妙handout 讲义one problem though with … is … 但是…有一个问题在于…there weren’t enough copies on reserve 保留地副本不够if you can’t … how are you supposed to… 如果你不能…那么你怎么能…Don’t talk about it, I only got mine yesterday, it was a real struggleI hate to think what mark I’ll getoral presentation 口头陈述criteria 标准written work 书面作业 Test 3 Listening Section 4 make an effort to 努力（做）…this is a lower figure than in most other European countriesincrease dramaticallymeet its recycling targetsagreed targets 商定的目标the production of recycled glass and paper uses much less energy than producing them from virgin materialslandfill site 垃圾填埋点incineration plant 垃圾焚烧厂drop-off 下降，投放，衰退sorting and baling 分拣和打包all sorts of = all kinds of 各种各样的toughen 使变坚韧bottle 瓶jar 广口瓶，罐子container 容器，集装箱，货柜oddly enough 说来奇怪fibreglass 玻璃纤维filtration 过滤crushed glass 碎玻璃for recycling paper, British comes second in Europe with 40%, behind Germany’s amazing 70%office stationary 办公文具the recycled paper costs the same as normal paper and is of equally high qualityit comes at a cost (in terms of…) 这是有(…)代价的soil conditioner 土壤调节剂look into the possibility of alternative uses 研究其他用途的可能性car bumper 车保险杠scheme 计划，不切实际的念头，阴谋，体系，结构，方案，社会保障性住房vend 出售，售卖polystyrene 聚苯乙烯polycup 聚苯乙烯杯子to sum up 总而言之there seems to be plenty of research going on into how to do sth. 关于如何做某事似乎有很多研究正在进行中 Test 3 Reading Passage 1 Early childhood education unquestionably 毫无疑问地in ordinary conversation 在平常的谈话中born with natural curiosity 天生有好奇心suppress 镇压，封锁，忍住，阻止，抑制dramatically 戏剧性地，激动人心地，突发惊人地human personality 人格It is generally acknowledged that 人们普遍认为socio-economic 社会与经济的educational under-achievement 学业不良a lot of money was poured into it 很多钱都投进去了be supposed to 应该，被期望substantial funding 大量资金there are two explanations for this 对此有两种解释measurable 可计量的，显著的disadvantaged home environment 弱势家庭环境pilot programme 试点计划the programme was predicated on research 该方案以研究为基础bypass 越过the most effective way of doing sth.get off 下车，下来，出发，下班，免受处罚，入睡，发生关系，放开represent a cross-section of socio-economic status, age and family configurations 代表社会经济地位、年龄和家庭结构的横截面single-parent family 单亲家庭two-parent family 双亲家庭family in which both parents worked 父母都在工作的家庭family with either the mother or father at home 母亲或父亲在家的家庭Information on child development, and guidance on things to look for and expect as the child grows were provided, plus guidance in fostering the child’s intellectual, language, social and motor-skill developmentperiodic check-up 定期检查sensory 感觉的detect possible handicaps 检查出可能的生理缺陷interfere with growth and development 妨碍生长发育refer sb. to sb./sth. 让某人求助某人/参考某物alongside 在…旁边，和…在一起phenomenal 不寻常的make great strides in the development of 实现…的跨越式发展in such things as 在这样的事情上auditory comprehension 听觉理解verbal ability 言语能力language ability 语言能力bore little or no relationship to 与……关系不大或没有关系perform equally well regardless ofbe virtually eliminated 几乎被消除be not necessarily bad 不一定坏perpetuate 使永久initiative 主动性，主动行为，主动权，立法提案程序outline 画…的轮廓，概述now the focus is on doing sth. 现在的重点是…institutionalised 制度化的education is undoubtedly vital 教育无疑至关重要overcome educational inequity 克服教育不平等administer 管理，执行，施用follow-up 加强，跟进 Test 3 Reading Passage 2 Disappearing data delta 三角洲fertile 肥沃的，能生育的，有创造力的，提供发展可能的natural fertilizer 天然肥料the Nile delta 尼罗河三角洲the River Nile 尼罗河erode 侵蚀，削弱… along 向前，一起，到某处along… 沿着along with 与…一起，与…同时Egypt 埃及Mediterranean 地中海coast 海岸，沿海地区，海边，滑行coastline 海岸线at an astounding rate 以惊人的速度… , in some parts estimated at 100 metres per yearscour 擦净，擦去sediment 沉淀物，沉积物this is no longer happening 这种情况不再发生blame sth. on sb./sth. 把某事归咎于某人/某事物blame sb./sth. (for sth.) （把某事）归咎于某人/某事物lay/place/put the blame on sb./sth. 归咎于某人/某事take/bear the blame (for sth.) （为某事物）承担责任blame oneself for sth. 因某事自责dam 水坝，水库，堤堰the Three Gorges Dam 三峡大坝hold back 阻止，挡住，固定，抑制，妨碍，向某人隐瞒，扣住；犹豫virtually 几乎huge quantities of 大量的interior 内部，内陆，内政，内景a region of over 100 square kilometresfertile silt 肥沃淤泥nutrient-rich 营养丰富dispense with 省掉，摒弃the richest food-growing area 最肥沃的粮食种植区accumulate 积累；积聚upstream half of Lake Nasser 纳赛尔湖上游there turns out to be more to the storyemerge from 来自river bed 河床river bank 河岸on the 800-kilometre trip to 在去往…的800公里旅途中850 grams of sediment per cubic metre of water 每立方米水850克沉积物the significance of this didn’t strike me until 直到…我才意识到这件事的重要性replenish 再装满，补充divert 使转向irrigation canal 灌溉渠lagoon 环礁湖very little of itplain 平原aquaculture 水产养殖come to rest 停止移动municipal 市政的agricultural 农业的be laden with 装载着pollutant 污染物concur 同意，赞同mercury 汞lead 铅copper 铜zinc 锌coincide with 与…一致leaded fuel 含铅燃油increase dramatically = grow rapidly 急剧增长poison 毒物，有害物food chain 食物链productivity 生产率，丰产agricultural waste 农业废弃物stimulate increases in plant growth 促进植物生长upset the ecology of the area 破坏该地区的生态begin to pay close attention to 开始密切关注…, partly because…, but principally because… …部分原因是…，但主要原因是…in the immediate future 在不久的将来one solution would be to 一个解决办法是flush out 冲洗waterway 航道desalination 脱盐devise a way to 设计出一种方法…is easier said than done 说时容易做事难 Test 3 Reading Passage 3 The return of artificial intelligence after years in the wilderness, AI seems poised to make a comeback 在多年的沉寂后，AI似乎准备卷土重来AI was big in the 1980s but vanished in the 1990sre-enter public consciousness 重新进入公众意识executive 总经理marketing people 营销人员irony 反语，具有讽刺意味的事inverted commas 引号hype 不实宣传admittedly 诚然the rehabilitation of the term has a long way to go 要给这一术语正名还有很长的路要走over-ambitious 好高骛远的under-achieving 未实现的field of research 研究领域coin 创造conference 会议become leading figures in the field 成为该领域的领军人物informative 提供有用信息的encompass 包含，围绕disparate 迥然不同的operations research 运筹学cybernetics 控制论capture 俘获，吃，刻画capture the public imagination 抓住公众的想象力mimic 模仿attack the problem 解决问题unify 统一peak 达到最高峰a person reared on stories of the sea/science-fiction movies （听海的故事/看科幻电影）长大的人have high expectations (of sb. / for sth.) 对…寄予厚望imply 暗示，意味着，表示a breakthrough is just around the corner 突破就在眼前be substantially resolved 很大程度上被解决prototype 原型diagnosis 诊断，判断it proved to be a false dawn 事实证明这是个虚幻的黎明materialise 实现and a backlash ensued 接着出现了强烈反弹undue optimism 过分乐观retrenchment 紧缩开支opt 选择opt for sth. 选择某物opt (not) to do sth. 选择（不）做某事align with 与…结盟align oneself with the movement 支持运动ironically 讽刺的是in some ways 在某些方面be a victim of its own success 称为自身成就的受害者an apparently mundane problem 一个看似平凡的问题unattended 无人看管的deem 认为characterise 描绘，刻画，是…的特征goal-post 球门柱blue-sky 不能付诸实行的commercialisation 商业化stand for 代表，容忍yet 然而all three once fell well within the umbrella of AI researchthe tide may now be turning 现在形势可能正在转变reckon 认为，觉得，估计，计算，希望，看好；计算，估计，认为，the most powerful and promising approach 最强大和最有希望的方法cluster 群，串，束，组，星团，数据组spot 看见，认出，使有斑点，使有污渍，借给spot camouflaged vehicles on a battlefield 在战场上发现伪装的车辆live up to 遵守，不辜负boost the prospects for 促进…的发展前景in the near future 在不久的将来differentiate 区分，求…的微分in particular 尤其information overload 信息过载Odyssey 奥德赛lipread 唇读encapsulate 概括，包含there is (still) no sign oftranscribe 转写，转录，改编the theory of … still remains elusive 关于……的理论仍然难以捉摸comparison 比较，对比，类似match up to 与…一致military 军事的close to fruition 接近实现changing perception 转换观念premature implementation 过早实施prospect 希望，前景，景色，有望获胜者，潜在客户 Test 4 Listening Section 1 fix sb. up with… = fix up sb. with… 为某人安排/提供…take a few details 了解一些细节when would the best time to catch/contact youI’m planning on doing sth.get an extension to one’s permit 延长许可证occupation 居住，占领，职业，消遣particular requirement 特殊要求vegetarian 素食者en suite 与卧室配套的real gardenyou do sth. that way 那样你就能做某事了be partly dependent on 在一定程度上取决于I was thinking in terms of (doing) sth. 我刚在想…go up to 上升到I don’t think we’d have any problem doing sth. 我认为我们要做某事不会有任何问题move in 搬进来（去）go for 袭击，喜欢，选择，争取，适用于，以…的价格出售 Test 4 Listening Section 2 look forward to 期待，预料take a few minutes to do sth.some changes to sth.junior 较年幼的，级别较低的，适合青少年的，小；年少者，职位较低者，大儿子，小学生，大学三年级学生senior 年长的，较高的，老/大，高年级的，毕业年级的，成人的；年长者，级别较高者，高年级学生，毕业年级学生clubhouse 俱乐部会所picnic 野餐presentation of prizes 颁奖training session 训练期committee 委员会president 总统，会长，总裁treasurer 司库，财务主管secretary 秘书，干事，大臣/部长coach 教练，辅导教师，指导，长途汽车，火车车厢，四轮马车，经济舱take on the job of 担任…职位volunteer to be 志愿做collect fees 收费supervise 管理，监督，监管at training sessions and on match days 在训练期和比赛日have some refreshments 吃点点心 Test 4 Listening Section 3 case study 跟踪研究，个案研究as a part of your exam assessmentbe in the middle of problems at the moment 处于问题的中间read through 通读，仔细阅读take on board 接受（主意）；理解（问题）advertising campaign 广告战，广告宣传活动falling sales 销售下降this is something that had many causeson top of that immediate problem 除了这个眼前的问题expansion plan 扩张计划face up to 勇敢面对，正视get to grips with 认真考虑并着手处理be stalled by a strike 因罢工而停摆it was just when 正是…的时候make a colossal investment in 对…进行巨额投资machinery 机器，机件，机构production machinery 生产设备plant ，大型机器，植物，发电站卧底，栽赃物品fair 合理的，公正的，尚好的，相当，晴朗的，顺风的，浅色的，美丽的they’ve hit on the right things 他们找到了正确的方法it would be easy to say (that)… but in fact…the signs are good 迹象很好be set back by high interest rates 受到高利率的影响而耽误long-term problem 长期问题market share 市场占有率be (eventually) credited to （最终）归因于having done sth. I think that’s rightonto a larger issues then 然后再谈一个更大的问题have the choice of doing sth. 可以选择做某事very favourable terms 非常优惠的条件buy out 买下…全部股份，赎买，购空存货with a new image 以新的形象decide on a bolder move 决定采取更大胆的行动offer some new shares 发行一些新股cautious 小心谨慎的back 资助，支持，证实，使倒退，下赌注于，在…背后加固，为…伴奏，位于…后面capital 资本，资方，好处，大写字母，首都，重要都市you mustn’t always assume that dramatic problems require dramatic solutionsdramatic 戏剧的，戏剧性的，激动人心的，突发的dramatically 从戏剧角度，戏剧性地，激动人心地，突发惊人地to deteriorate dramatically 急剧恶化fix 解决办法，困境，一剂毒品，受操纵的事approach 方法，提议，通道，靠近，近似的事物have more chance of successalter how they’re running things 改变他们的运作方式management layer 管理层management process 管理程序would have gone by now 此刻可能将已经消失了telecommunications market 电信市场session 集会，一段时间，学年/学期，录音时段，畅饮suggest some ways in which they might overcome their problems and outline the reasons why you think as you do 提出一些他们可能克服问题的方法，并概述你这样思考的原因keep it intrinsic to…rather than dragging in other examples 保持围绕…本身而不要牵扯其他范例I’ve got great hopes for it 我对它抱有很大的希望sb. be innovative with sth. 使某物具有创新性set new trends 引领新潮流foregone conclusion 预料之中的必然结局manage to 设法，达到boost 促进/激励，增长，宣传long-lasting 持久的… but he would say that 他这么说毫不奇怪outdated 过时的the stock market is to blame 股市是罪魁祸首inevitably 不可避免地，不出意料地it didn’t perform 它没有发挥作用the market should have had more realistic expectations 市场应该有更现实的预期 Test 4 Listening Section 4 are you all settled? 你们都安顿好了吗?need some sort of guidance toguided tour 有导游的游览we find this rather muddles people 我们发现这更让人感到混乱run a series talks 举办系列讲座get the most out of 发挥…的最大功效be computer literate 精通电脑bring you up to speed on 让你了解…最新情况outline 轮廓，提纲permanently 永久地readily 乐意地，容易地print off 大量印刷you can find lots on there but much of it is useless informationhighly debatable 极具争议的critical 批判性的，关键的，危重的，以异文校勘的，评论家的，有鉴别能力的specialist reference resources 专业的参考资源at very little extra cost 只需很少的额外费用save sb./sth. (from) doing or having to do sth. 使某人/某物不必做某事accessible 容易到达的，易获得的，易理解的，负担得起的shelf 架子the intention is to do sth.phase out 逐步废除additional to 附加于section manager 部门经理get suck doing sth. 做某事遇到难题catalogue 目录，图书目录，一系列，课程概览training supervisor 培训主管oversee 监视，监督induction 就职，引起，入门，催产，征兵，电磁感应specialised training sessions 专门的培训课程write a dissertation 写一篇论文be relevant to… 与…有关undergraduate 本科生graduate 毕业生postgraduate 研究生department 部门，科，系，省planning stage 计划阶段tutor 家庭教师，导师，助教，班主任at the outset 在一开始时set out 动身，着手安排，摆放，陈述biography 传记bibliography 书目subject area 主体范围look through 浏览，在…中查找，无视 Test 4 Reading Passage 1 The impact of wilderness tourism tourist attraction = tourist destination = tourist resort 旅游胜地… is booming as never before …正空前繁荣wilderness tourism 荒野旅游high-spending tourist 高消费旅客initial investment 初始投资conference 会议fragile 易碎的，娇嫩的，脆弱的vulnerable 脆弱的，地位不稳固的，易受影响的highly vulnerable to abnormal pressure 极易受到异常压力的影响ecology 生态（学）inhabitant 居民，栖息动物arctic areas/zones 北极地区marked 明显的seasonality 季节性harsh conditions 恶劣条件prevail 流行，普遍存在，占优势prevail for many months each year 每年普遍存在几个月be limited to quite clearly defined parts of the year 仅限于一年中明确界定的部分be drawn to 被…所吸引natural landscape 自然景观indigenous people 土著人unique cultures 独特文化new breed of 新一类…, grateful for … 感谢…hard currency 硬通货the prime source of foreign exchange 外汇的主要来源a key element in …中的关键因素Monument Valley 纪念碑谷the effect on … are profound 对…影响深远hill 小山，山坡hill-region 丘陵地区hill-farmers can make more money in a few weeks working as porters for foreign trekkers than they can in a year working in their fieldslead to serious decline in 导致…的严重减少terrace 梯田tend to 倾向于year-round 全年的culprit 罪犯，问题的根源the (main) culprit behind (youth) crime 青少年犯罪后的主要原因wage labour 雇用劳动government handouts 政府救济undermine 暗中颠覆/破坏，侵蚀，在…下挖dilemma 窘境dry up 干涸，耗尽，擦干餐具，住嘴erosion 侵蚀，削弱trail 小径，痕迹，踪迹，路径deforestation 砍伐森林water supplies may be limited or vulnerable to degradation through heavy use 由于大量使用，供水可能会受到限制或容易退化legion 大量的（贬义）one’s cromes are legion 某人的罪行罄竹难书inevitably 不可避免地minimize 减到最低限度a vehicle for 一个…的工具reinvigorate 给…注入新的活力operator 经营者over the long term 长远来看result in limits being imposed on their growth 导致他们的成长受到限制renaissance 复兴communal 公共的，共同的，公用的；各团体之间的transient worker 临时工repatriate 遣返，把…调回本国home base 基地，大本营accrue 累积follow similar strategy 遵循类似的策略reservation 居留地high-quality 高级的handicraft 手工艺（品）artwork 插图，艺术品pottery 制陶，陶器，陶器厂/作坊lost control over 失去了…的控制penetrate 穿透cannot be the solution to the imbalance 这不是解决不平衡的办法aspiration 志向，送气，吸引术become the norm, rather than the exception 变成常态而不是一个例外 Test 4 Reading Passage 2 Flawed beauty: the problem with toughened glass a pane of toughened glass 一片钢化玻璃a sheet of ordinary glass 一片普通玻璃roof 屋顶shatter 碎裂；打碎，破坏，使震惊，使精疲力竭frame 构架，边框，身躯，画面minute crystals = tiny crystals 微小晶体nickel sulphide 硫化镍chairman 主席，会长，董事长standards committee 标准委员会trade association 行业协会very rare phenomenon 非常罕见的现象on average 平均而言consultant engineer 顾问工程师investigation 调查研究tell of 谈及know of 知道，听说the tip of the iceberg 冰山一角press 报道bus shelter 公共汽车候车亭five times the strength ofit shatters into tiny cubes rather than large, razor-sharp shards 它会粉碎成细小的立方体，而不是像剃刀一样锋利的大碎片architect （建筑）设计师bolt 用螺栓固定ceiling 天花板slightly 略微地，纤细的jets of cold air 一股股冷空气this causes the outer layer of the pane to contract and solidify before the interior 这会导致玻璃的外层在内部之前收缩和固化shrink 缩小，退缩，回避exert a pull on the outer layer 对外层施加拉力produce a tensile force inside the glass 在玻璃内部产生张力cracks propagate best in materials under tensionimpurity 杂质trace amounts of 微量nickel 镍sulphur 硫磺sulphide 硫化物fragments of nickel alloys 镍合金碎片furnace 熔炉can exist in two forms 可以以两种形式存在toughening process 强韧处理subsequent 随后的unstable 不稳定的coil 蜷缩spring 弹簧，发条prime 事先指点/准备tensile region 拉伸区unleash 发泄，突然释放the time that elapses before … 在…之前流逝的时间sunlight 阳光speed up 加速（…的速度）ironically 讽刺地inclusion 包括，被包括的项目sulphide inclusion 硫化物夹杂物scale 等级，刻度，比例，规模，音阶；秤；鳞，水垢，鳞屑the picture is made more complicated by the fact that 这情形因以下事实而变得更加复杂into double figures 达到两位数suffer a rash of failures 屡遭失败call in 请来，找来contamination 污染cradle 摇篮，发源地，托架，听筒架，吊篮microfiche 微缩胶片nickel sulphide crystals 硫化镍晶体alternative 选择，可能的选择re-clad 重新包覆would have cost ten times as much 会花十倍的钱publicity 媒体的关注，宣传，宣传材料suppress 镇压，封锁，忍住，阻止，抑制exaggerate 夸大delayed failure 延迟破坏dispute 就…争论，对…怀疑，争夺little doubt was expressed about 对…没有表示怀疑documented 有文件可证明的incidence 发生 Test 4 Reading Passage 3 The effects of light on plant and animal species organism 有机体cue 暗示，提示timing 时间选择，实际掌握，点火时间控制，特定时间，时长rhythm 节奏，韵律，循环往复breeding 繁殖，饲养，教养trigger 引发fluctuate greatly from day to day 每天波动很大increase steadily by a predictable amount 以可预测的数量稳步增长physiological responses 生理反应photoperiodism 光周期现象（性）induce 诱导photoperiod 光周期a certain critical length 某一临界长度exceed 超过vegetative growth 营养生长neutral 中立的，平淡的，相互抵消的，不带电的，中性的occupy 居住，占用，担任，占领，占据，使忙碌offspring 幼崽，子女food reserves 粮食储备build up 积聚，鼓舞，树立，吹捧，增强reproduction 繁殖after fledging 羽翼未丰temperate-zone 温带nest 筑巢assure 确保，弄清adaptive significance 适应意义seedling growth 幼苗生长fertilization 施肥seed ripening 种子成熟evolutionary advantage 进化优势favourable 肯定的，赞同的，有利的，合适的desert annuals 沙漠一年生植物germinate 发芽，产生；使…发芽，使…产生rainfall 降雨量extraordinary 特别的，非凡的perennial 持久的，反复出现的，多年生的，长期的flower 开花set seed 结籽fruit 结果die 枯萎vegetative cycle 生长（营养）周期trigger 扳机，触发器，触发因素flowering cycle 开花周期simultaneous production 联产法masses of 大量的photosynthesis 光合作用organic material 有机材料uptake of carbon 碳的吸收light intensity 光强度at one-quarter full sunlight 在四分之一充足的阳光下sugarcane 甘蔗shade-tolerant 耐荫forestry 林业horticulture 园艺become adapted to (doing) sth. 适应（做）某事evolve a series of characteristics 形成一系列特征occupy other habitats 占领其他栖息地hemlock 毒芹（毒素）seedling 幼苗understorey 下层林木have yet to 尚未;尚有待于;还没有","categories":[{"name":"English","slug":"English","permalink":"https://sunwucheng.com/wiki/categories/English/"}],"tags":[]},{"title":"CATTI","slug":"English/CATTI","date":"2020-10-31T16:00:00.000Z","updated":"2022-03-27T01:46:00.467Z","comments":true,"path":"20201101/","link":"","permalink":"https://sunwucheng.com/wiki/20201101/","excerpt":"","text":"CATTI (China Accreditation Test for Translators and Interpreters)CATTI（全国翻译专业资格水平考试） 报名要求：二、三级口、笔译考试无限制报名 报名时间：09.05~09.13 考试时间：11.14~11.15 考试费用 口译考试 一级口译：《口译实务1h》 二级口译：《口译综合能力1h》、《口译实务1h》 笔译考试 一级笔译：《笔译实务3h￥65》 二级笔译：《笔译综合能力2h,￥61》、《笔译实务3h￥65》 2018年（上）三级笔译综合能力——Vocabulary Selection A man who _____ after his heart stopped described his experience to other people.A. removed B. recovered C. revived D. relived When working in a team, I often find myself spending so much time getting others to do their work that our _____ is less satisfactory than if I have done it myself.A. outcome B. output C. outflow D. outset Translation is both a cognitive procedure which occurs in the translator’s head and a social, cross-linguistic and cross-cultural _____ .A. practice B. research C. discipline D. behavior The queen of psychological suspense, Sophie Hannah, is returning with her chilling new Culver Valley crime novel _____ Detective Simon Waterhouse and Sergeant Charlie Zailer.A. selecting B. including C. starring D. featuring A series of studies in the Journal of Consumer Research explored observers’ reactions to people who broke _____ norms only slightly.A. complicated B. established C. authenticated D. falsified The struggle between liberty and authority is the most _____ feature on the portions of history with which we are familiar, particularly in that of Greece, Italy and England.A. great B. incomprehensible C. conspicuous D. excellent A killer whom the police are calling “Billy Dead Mates” has _____ four lives, and detectives are baffled.A. claimed B. stopped C. relinquished D. vanquished As the evidence slowly _____ , Nick is incriminated in horrible ways. But he swears he didn’t murder his wife.A. proves B. clears C. shows D. mounts Slowly, it began to _____ on me that my job did not really require that I spend 12 full hours a day in the crowded office.A. shine B. dawn C. flash D. pass The two most important _____ in making a cake are flour and sugar.A. elements B. factors C. components D. ingredients The _____ from childhood to adulthood is always a critical time for everybody.A. transformation B. transcendence C. transition D. transfer Many auto accidents were _____ to careless driving.A. attributed B. attested C. attached D. attuned The novelist has said that fictional surprises would allow us to _____ reality.A. apply B. approve C. apprehend D. appreciate The young couple used to quarrel a lot, but they are now completely _____ with each otherA. reconciled B. related C. relieved D. reunited According to eye witness, the lorry _____ two or three times before rolling down the slope.A. ran B. darted C. jumped D. bounced We don’t _____ any difficulties in completing the project so long as we keep within our schedule and budget.A. forestall B. formulate C. foresee D. forfeit Nothing fuels enthusiasm more than watching two famous teams wrangle over the _____ as “the best team of the year.”A. name B. title C. reputation D. success His fame was _____ affected by an irresponsible speech he made in public.A. accidentally B. absurdly C. adversely D. abruptly The mother tried to _____ her son’s interest in music by taking him to concerts frequently.A. form B. foster C. follow D. foment Scientists believe that there is not enough oxygen in the moon’s atmosphere to _____ plant life.A. survive B. sustain C. supply D. suppose 习题答案 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 B B A D B C A D B D C A D A D C B C B B","categories":[{"name":"English","slug":"English","permalink":"https://sunwucheng.com/wiki/categories/English/"}],"tags":[]},{"title":"Introduction","slug":"index","date":"2020-09-30T16:00:00.000Z","updated":"2022-08-25T07:42:56.497Z","comments":true,"path":"20201001/","link":"","permalink":"https://sunwucheng.com/wiki/20201001/","excerpt":"","text":"历史笔记文档 编程：C、Python 英语：英语发音、英语语法 专业：金刚石工具、钻井液、企业实习、毕业论文 其他：数学内容、摩擦磨损 文献管理软件 免费且开源的Zotero：Zotero官方文档，Zotero文献生态 文献可视化分析 网页端：文献计量在线分析平台，如何使用「文献计量在线分析平台」 简单的：VOSviewer 复杂的：CiteSpace，官方使用教程-视频 学术资源共享 RSS在线: Feeder.co(国内访问歇菜) RSS插件: Feedbro(浏览器插件) Zlibrary: https://u1lib.org/ 论文书写辅助 数学公式处理: Mathpix 图片转公式 PDF文档处理: Adobe压缩pdf 图片处理工具: PS在线、PS去图片背景、Gif处理、Tiff转Jpg 图像压缩工具: TinyPNG、IMGtop、GIF压缩 图表绘制工具: diagrams.net 兴趣爱好探索 2022-07-10 17:00（视频）王华明 谈金属3D打印技术应用 航空/航天/月球基地/装备制造业 2021-07-16 18:00（视频）实现绕、落、回，下一步：建立月球科研站！ 2021-01-26 16:00（视频）NASA火星洞察号“解救鼹鼠”行动历时一年半宣告失败，不只是运气不好【行星事务所 VOL. 08】","categories":[],"tags":[]},{"title":"RaspberryPi","slug":"CS&EE/RaspberryPi","date":"2020-06-30T16:00:00.000Z","updated":"2022-06-08T07:47:46.000Z","comments":true,"path":"20200701/","link":"","permalink":"https://sunwucheng.com/wiki/20200701/","excerpt":"","text":"0. 树莓派配置(RaspberryPi Setup)0.1. 下载安装系统镜像文件到U盘 烧录工具：https://www.raspberrypi.org/downloads/镜像地址：https://www.raspberrypi.org/downloads/raspberry-pi-os/ 0.2. 镜像文件编辑0.2.1 ssh在boot分区下新建一个空文件，名为ssh，就可以开启SSH，一定要是文件全名。 0.2.2 wifi再在boot分区下新建wpa_supplicant.conf文件，并写入无线的相关配置。 123456789country&#x3D;CNctrl_interface&#x3D;DIR&#x3D;&#x2F;var&#x2F;run&#x2F;wpa_supplicant GROUP&#x3D;netdevupdate_config&#x3D;1 network&#x3D;&#123; ssid&#x3D;&quot;这里填写你的WIFI&quot; psk&#x3D;&quot;密码&quot; key_mgmt&#x3D;WPA-PSK&#125; 如果无线网没有密码或者采用WEP加密方式的话，key_mgmt应设为NONE，密码字段由psk改成wep_key0即可。 0.3. 系统配置0.3.1 修改密码修改pi和root账户的密码 12sudo passwd pisudo passwd root 0.3.2 解锁root用户123sudo passwd --unlock root# 切换到root终端su root 0.3.3 更改apt软件源与系统源12345678910111213# 第一步，先备份源文件。sudo cp &#x2F;etc&#x2F;apt&#x2F;sources.list &#x2F;etc&#x2F;apt&#x2F;sources.list.baksudo cp &#x2F;etc&#x2F;apt&#x2F;sources.list.d&#x2F;raspi.list &#x2F;etc&#x2F;apt&#x2F;sources.list.d&#x2F;raspi.list.bak# 第二步，编辑系统源文件。sudo nano &#x2F;etc&#x2F;apt&#x2F;sources.list# 第三步，将初始的源使用#注释掉，添加如下两行清华的镜像源。# 注意：这里咱们用的树莓派系统是Raspbian-buster系统# 所以在写系统源链接时要注意是buster，网上很多教程都是之前stretch版本，容易出错！deb http:&#x2F;&#x2F;mirrors.tuna.tsinghua.edu.cn&#x2F;raspbian&#x2F;raspbian&#x2F; buster main contrib non-free rpideb-src http:&#x2F;&#x2F;mirrors.tuna.tsinghua.edu.cn&#x2F;raspbian&#x2F;raspbian&#x2F; buster main contrib non-free rpi# 第四步，按Ctrl+O保存，Ctrl+X退出。# 第五步，最后执行如下命令 sudo apt-get update，完成源的更新软件包索引。sudo apt-get update 0.3.4 更改pip源123456789# 输入以下命令来编辑pip.conf文件sudo nano &#x2F;etc&#x2F;pip.conf# 然后将原本的内容注释，把以下内容复制进去[global]index-url &#x3D; http:&#x2F;&#x2F;pypi.douban.com&#x2F;simpletrusted-host &#x3D; pypi.douban.comdisable-pip-version-check &#x3D; truetimeout &#x3D; 120# 老方法，按Ctrl+O保存，Ctrl+X退出。 0.3.5 设置静态IP, 这样每次登陆就可以直接输入了。123456789101112131415161718# 修改 dhcpcd.conf 文件sudo nano &#x2F;etc&#x2F;dhcpcd.conf# 内容改为interface eth0 static ip_address&#x3D;192.168.1.101&#x2F;24static routers&#x3D;192.168.1.1static domain_name_servers&#x3D;192.168.1.1 interface wlan0 static ip_address&#x3D;192.168.1.102&#x2F;24static routers&#x3D;192.168.1.1static domain_name_servers&#x3D;192.168.1.1# eth0为连接网线时的IP# wlan0为连接无线时的IP# ip_address是静态IP 0.4. 解决问题0.4.1 解决树莓派连接wifi却不能上网的方法树莓派连接手机热点和某些wifi能够上网，而在连接一些wifi后进入网站却显示无法解析域名。此时可以通过修改树莓派配置文件来解决这个问题。 1234# 首先输入以下命令来修改配置文件sudo nano &#x2F;etc&#x2F;resolv.conf# 然后将nameserver后面的一系列数字改成8.8.8.8即可。# 最后保存，退出 0.4.2 鼠标延迟打开SD卡根目录的cmdline.txt文件, 在第一行最后添加一个空格,然后加入usbhid.mousepoll=0. 0.4.3 屏幕有黑边打开SD卡根目录的config.txt文件,第10行#disable_overscan=1的#删除既可。 0.5 其他配置0.5.1 安装某型号LCD屏幕驱动12345# 适用于32位树莓派OSsudo rm -rf LCD-showsudo git clone https:&#x2F;&#x2F;github.com&#x2F;waveshare&#x2F;LCD-show.gitcd LCD-show&#x2F;sudo .&#x2F;LCD35-show","categories":[{"name":"CS&EE","slug":"CS-EE","permalink":"https://sunwucheng.com/wiki/categories/CS-EE/"}],"tags":[]},{"title":"Arduino","slug":"CS&EE/Arduino","date":"2020-05-31T16:00:00.000Z","updated":"2022-06-08T07:47:39.000Z","comments":true,"path":"20200601/","link":"","permalink":"https://sunwucheng.com/wiki/20200601/","excerpt":"","text":"来源: Arduino程序设计基础 (第2版) 1. 初识Arduino1.1 什么是ArduinoArduino既是一块小小的电路板，还是一个开放的电子开发平台Arduino既包含了硬件——电路板，也包含了软件——开发环境和分享的代码、程序 1.2 Arduino的由来 开源项目 对Arduino贡献 GCC/G++ Arduino编译器 AVR-Libc Arduino语言 Wiring Arduino语言 JAVA Processing开发环境 Processing Arduino集成开发环境 AVR-DUDE 程序下载到控制器 1.4 Arduino控制器 Arduino 101 / Genuino 101 Arduino UNO Arduino MEGA Arduino Leonardo Arduino Due Arduino Zero 小型化Arduino Arduino Nano Arduino Mini Arduino Micro Arduino Lilypad Arduino兼容控制器 Zduino UNO Zduino Leonardo Zduino MEGA 衍生控制器 Intel Galileo Maple ChipKit Google ADK 2012 1.4.3 Arduino UNO R3 电源 Power USB接口 5V DC电源输入接口 7~12V 电源接口处5V端口 5V 电源接口处VIN端口 7~12V 指示灯 LED 点亮 ON 电源指示灯 Arduino通电时 TX 串口发送指示灯 USB连接计算机且Arduino向计算机传输数据时 RX 串口接收指示灯 USB连接计算机且Arduino接收计算机的数据时 L 可编程控制指示灯 13号引脚为高电平或高阻态时 复位按键 Reset Button 存储空间 Memory 详情 Flash 32KB 0.5KB = BOOT区，用于储存引导程序；31.5KB = 用户储存程序的空间 SRAM 2KB CPU运算时在其中开辟一定储存空间，Arduino断电或复位后其中数据丢失 EEPROM 1KB (电可擦写的可编程只读存储器) Arduino断电或复位后其中数据不会丢失 输入/输出端口 Input/Output Port 作用 UART通信 0(RX)，1(TX) 接收和发送串口数据 外部中断 2，3 输入外部中断信号 PWM输出 3，5，6，9，10，11 输出PWM波 SPI通信 10(SS)，11(MOSI)，12(MISO)，13(SCK) SPI通信 TWI通信 A4(SDA)，A5(SCL)，TWI接口 TWI通信，兼容IIC通信 AREF AREF接口 模拟输入参考电压的输入端口 Reset 复位端口 按下复位键，端口接低电平，使Arduino复位 1.5 Arduino软件 (Arduino IDE 下载)2. 基础篇2.1 Arduino语言及程序设计结构2.1.1 Arduino语言Arduino使用C/C++语言编写程序 (早期Arduino核心库使用C语言编写，最新核心库采用C与C++混合编程)Arduino语言: 通常指Arduino核心库文件提供的各种应用程序编程接口(Application Programming Interface)集合 2.1.2 Arduino程序结构Arduino程序表面上看没有main()函数，实际其定义隐藏在Arduino的核心库文件中Arduino开发时一般不直接操作main()函数，而是使用setup()和loop()这两个函数 123456789101112void setup()&#123; &#x2F;&#x2F; 在这里填写setup()函数代码，此程序只会运行一次 &#x2F;&#x2F; Arduino控制器通电或复位后，即会开始执行setup()函数中程序&#125;void loop()&#123; &#x2F;&#x2F; 在这里填写loop()函数代码，此程序会不断重复运行 &#x2F;&#x2F; setup()函数中程序执行完毕后Arduino会接着执行loop()函数中程序，进入程序死循环&#125; 2.2 C/C++语言基础2.2.1 数据类型【常量】 含义: 程序运行过程中，其值不能改变的量 命名: 可以是字符，也可以是数字 定义: #define 常量名 常量值; e.g., #define PI 3.1415926535897932384626433832795; 【变量】 含义: 程序中可变的值 定义: 类型 变量名; e.g., int i;，int i=95; 整数类型 取值范围 说明 int -32768 ~ 32767 整型 unsigned int 0 ~ 65535 无符号整型 long -2147483648 ~ 2147483647 长整型 unsigned long 0 ~ 4294967295 无符号长整型 short -32768 ~ 32767 短整型 Arduino Due 中，int 型及 unsigned int 型占用4字节(32位) 浮点类型 精度 float 4字节(32位) double 4字节(32位) Arduino Due 中，double 类型占用8字节(64位) 字符类型 精度 说明 char 1字节(8位) 存储字符变量 char col = &#39;C&#39;; 字符以数字形式存储在 char 类型变量中，数字与字符对应关系参照ASCII码 布尔类型 精度 说明 boolean 1字节(8位) false(假) or true(真) 2.2.2 运算符 运算符类型 运算符 说明 算术运算符 = 赋值 算术运算符 + 加 算术运算符 - 减 算术运算符 * 乘 算术运算符 / 除 算术运算符 % 取模 比较运算符 == 等于 比较运算符 != 不等于 比较运算符 &lt; 小于 比较运算符 &gt; 大于 比较运算符 &lt;= 小于或等于 比较运算符 &gt;= 大于或等于 逻辑运算符 &amp;&amp; “与” 逻辑运算符 || “或” 逻辑运算符 ! “非” 复合运算符 ++ 自加 复合运算符 – 自减 复合运算符 += 复合加 复合运算符 -= 复合减 2.2.3 表达式含义: 通过运算符将运算对象连接起来的式子 e.g., 5+3 a-b 1&lt;9 2.2.4 数组含义: 由一组具有相同数据类型的数据构成的集合定义: 数据类型 数据名称[数据元素个数]; e.g., int a[5];使用: 数组名称[下标] 访问数组中的元素 令数组中某一元素赋值: int a[5]; a[0] = 1; a[1] = 2; a[2] = 3; a[3] = 4; a[4] = 5; 令数组中在定义时赋值: int a[5] = &#123;1,2,3,4,5&#125;; 2.2.5 字符串定义: 以字符型数组方式定义: char 字符串名称[字符个数]; 使用String类型定义: String 字符串名称; 单独给赋值: String abc; abc = &#39;Arduino;’ 定义时赋值: String abc = &#39;Arduino&#39;; 2.2.6 注释1234567&#x2F;&#x2F; 单行注释内容&#x2F;* 多行注释内容1 多行注释内容2 ……*&#x2F; 2.2.8 顺序结构三种基本结构之一，也是最基本、最简单的程序组织结构，顺序结构中程序按语句的先后顺序依次执行一个程序或函数，在整体上是一个顺序结构，由一些列语句或控制结构组成，且都按先后顺序运行 2.2.9 选择结构/选取结构/分支结构if…else 语句 简单分支结构 1234if (表达式)&#123; 语句&#125; 双分支结构 12345678if (表达式)&#123; 语句 1&#125;else&#123; 语句 2&#125; 多分支结构 1234567891011121314151617if (表达式 1)&#123; 语句 1&#125;else if (表达式 2)&#123; 语句 2&#125;else if (表达式 3)&#123; 语句 3&#125;……else &#123; 语句 n&#125; switch…case 语句 12345678910111213141516switch (表达式) &#x2F;&#x2F;switch后的表达式的结果只能是整形或字符型&#123; case 常量表达式 1: 语句 1 break; case 常量表达式 2: 语句 2 break; case 常量表达式 3: 语句 3 break; …… default : 语句 n break;&#125; 2.2.10 循环结构/重复结构循环语句 while 循环: 一种“当”循环，即满足条件才会执行循环体内的语句 1234while (表达式) &#x2F;&#x2F;表达式永远为真或1时，成为死循环&#123; 语句&#125; do…while 循环: 一种“直到”循环，即一直执行循环体的语句直到条件不成立为止 12345do&#123; 语句&#125;while (表达式); for 循环: 一般，表达式1为循环初始化语句，表达式2为判断语句，表达式3为增量语句1234for (表达式1; 表达式2; 表达式3) &#x2F;&#x2F;如: for（i&#x3D;0; i&lt;5; i++)&#123; 语句&#125; 循环控制语句 break: 只能用于switch多分支选择结构和循环结构中，中止当前的选择结构或循环结构，转到后续语句运行 1234if (表达式)&#123; break;&#125; continue: 跳过本次循环中的剩余语句，进入判断下一轮循环是否执行 1234if (表达式)&#123; continue;&#125; 2.5 Arduino I/O 口的简单控制2.5.1 数字 I/O 口的使用数字信号: 以0、1二进制形式表示的不连续信号数字信号表示: Arduino中的数字信号，高电平为HIGH或1，地电平为LOW或0数字信号引脚: Arduino控制器上，每一个带数字编号的引脚都是数字引脚，包括写有’A’编号的模拟输入引脚数字信号引脚配置: pinMode(pin, mode); (pin: 引脚编号；mode: 配置模式) 模式名称 模式说明 说明/补充 INPUT 输入模式 可读取引脚数字信号: digitalRead(pin, value) OUTPUT 输出模式 可写入引脚数字信号:digitalWrite(pin, value) INPUT_PULLUP 输入上拉模式 空悬时默认电平为HIGH或1，联通后再重新判断 下拉/上拉: 将某节点通过电阻接GND/VCC的做法叫做下拉/上拉，这个电阻叫做下拉电阻/上拉电阻数字引脚别名配置: #define 引脚别名 引脚编号 或 (const) int led = 13; (led: 引脚别名；13: 引脚编号) 2.5.3 模拟 I/O 口的使用模拟信号: 用连续变化的物理量表示信息，信号随时间作连续变化的信号模拟信号表示: Arduino中的模拟信号，常用0-5V的电压来表示 模拟信号输入: 模拟输入引脚: Arduino控制器上，编号前带有’A’的引脚都是模拟输入引脚 模拟输入函数: analogRead(pin) e.g., analogRead(A0)(pin: 要读取模拟值的模拟输入引脚) 模拟输入精度: 使用AVR芯片作主控的Arduino的模拟输入功能有10位精度 (将0-5V电压转换成0-1023的整数形式) 模拟输入原理: ADC(Analog-to-Digital Converter)功能，将外部输入的模拟信号转换为数字信号，以读入模拟值 模拟信号输出: 模拟输出引脚: Arduino控制器上，带’～’的PWM引脚 模拟输出函数: anaogWrite(pin, value) (pin: PWM引脚；value: PWM脉冲宽度，0-255) 模拟输出精度: 可输出的PWM脉冲宽度为0-255 模拟输出原理: PWM(Pulse Width Modulation)方式，通过高/低电平的不断转换来输出周期固定(约490Hz)的方波，通过改变高地电平在每个周期中所占的比例(占空比)，而得到近似输出不同电压的效果(此方法仅能得到近似模拟值输出效果，另外可加外围滤波器以输出真正的模拟值) 2.6 与计算机交流——串口的使用Arduino与计算机通信最常用的方式是串口通信，Arduino控制器的串口都位于0(RX)和1(TX)两个引脚上Arduino的USB口都是通过转换芯片(通常是ATmega16u2)与Arduino的两个串口引脚连接Arduino控制器的这个转换芯片通过USB接口在计算机上虚拟一个用于与Arduino通信的串口Arduino与计算机建立串口连接后，要使串口与计算机通信，须先初始化Arduino的串口通信功能Arduino串口通信初始化: Serial.begin(speed) (speed: 串口通信波特率，即设定串口通信速率)波特率: 衡量通信速度的参数，表示每秒传送的bit的个数 (如 9600 波特 表示每秒发送 9600 bit 的数据)缓冲区: 指使用串口时，Arduino在SRAM中开辟的一段64B大小的空间 2.6.1 串口传输使用串口输出数据: Serial.print(val); Serial.println(val); (val: 要输出的各种类型数据，ln表示输出后换行) 2.6.2 串口输入串口接收到的数据都会被暂存在串口缓冲区，调用Serial.read()函数时，Arduino就会从中取出1B的数据串口缓冲区中没有可读数据时，Serial.read()函数会返回int型值-1，其对应的char型数据为乱码故通常使用串口读取数据前，先使用Serial.available()函数检测缓冲区中是否有可读数据 123456789101112131415&#x2F;* 示例用法 *&#x2F;void setup()&#123; Serial.begin(9600); &#x2F;&#x2F; 初始化串口&#125;void loop()&#123; if (Serial.available()&gt;0) &#x2F;&#x2F;检测缓冲区是否有数据: 有则读取，无则等待或跳过 &#123; char ch &#x3D; Serial.read(); &#x2F;&#x2F;读取缓冲区数据 Serial.print(ch); &#x2F;&#x2F;输出读取的数据 &#125;&#125; 2.7 时间控制函数2.7.1 运行时间函数millis(); 获取Arduino从通电(或复位)后到现在系统运行的时间，单位为毫秒，返回值类型为 unsigned longmicros(); 获取Arduino从通电(或复位)后到现在系统运行的时间，单位为微秒，返回值类型为 unsigned long 使用16MHz晶振的Arduino上，精度为4微秒使用 8MHz晶振的Arduino上，精度为8微秒 2.7.2 延时函数使用延时函数可暂停程序，并可通过参数来设定延时时间delay(); 毫秒级延时，参数数据类型为 unsigned longdelayMicroseconds(); 微秒级延时，参数数据类型为 unsigned int 3. I/O口高级应用4. 使用和编写类库5. 通信篇6. 存储篇7. 无线通信篇——红外遥控8. LCD显示篇9. USB类库的使用10. Ethernet类库的使用附录","categories":[{"name":"CS&EE","slug":"CS-EE","permalink":"https://sunwucheng.com/wiki/categories/CS-EE/"}],"tags":[]},{"title":"ML.DL","slug":"CS&EE/ML.DL","date":"2020-04-30T16:00:00.000Z","updated":"2022-09-28T09:12:14.750Z","comments":true,"path":"20200501/","link":"","permalink":"https://sunwucheng.com/wiki/20200501/","excerpt":"","text":"深度学习资料 课程教学 李宏毅2021/2022春机器学习课程：https://www.bilibili.com/video/BV1Wv411h7kN 跟李沐学AI：https://space.bilibili.com/1567748478 同济子豪兄：https://space.bilibili.com/1900783 梗直哥丶: https://space.bilibili.com/1921388479 来源：动手深度学习PyTorch版-李沐 1 课程安排 深度学习基础：线性神经网络 卷积神经网络：LeNet, AlexNet, VGG, Inception, ResNet 循环神经网络：RNN, GRU, LSTM, seq2seq 注意力机制：Attention, Transformer 优化算法：SGD, Momentum, Adam 高性能计算：并行，多GPU，分布式 计算机视觉：目标检测，语义分割 自然语言处理：词嵌入，BERT 2 深度学习介绍AI地图、图片分类、物体检测和分割、样式迁移、人脸合成、文字生成图片、文字生成、无人驾驶案例研究——广告点击：预测与训练，完整的故事 3 本地安装（略）4 数据操作4.1 N维数组N维数组是机器学习和神经网络的主要数据结构，样例： 0-d（标量）：一个类别 1-d（向量）：一个特征向量 2-d（矩阵）：一个样本——特征矩阵 3-d：RGB图片（宽×高×通道） 4-d：一个RGB图片批量batch（批量大小×宽×高×通道） 5-d：一个视频批量（批量大小×时间×宽×高×通道） 4.2 创建数组创建数组需要 形状：例如3×4矩阵 类型：每个元素的数据类型，如32位浮点数 数值：每个元素的值，如全是0或随机数 4.3 访问元素对m×n矩阵，有第0,1,2…i,…(m-1)行、第0,1,2…j,…(n-1)列 一个元素：[i,j] 一行元素：[i,:] 一列元素：[:,j] 一子区域：[$i_1$:$i_2$,j:] 一跳行子区域：[::i,::j]（从第0行0列元素开始，每i个数据取行、每j个数据取列访问元素） 4.4 数据操作实现张量表示一个数值组成的数组，这个数组可能有多个维度 12x &#x3D; torch.arrange(12)x 可以通过张量的shape属性来访问张量的形状和张量中元素的总数 12x.shapex.numel() 可以调用reshape函数来改变一个张量的形状而不改变元素数量和元素值 12x &#x3D; x.reshape(3,4)x 使用全0、全1、其他常量或者从特定分布中随机采样的数字 12torch.zeros((2,3,4))torch.ones((2,3,4)) 通过提供包含数值的Python列表（或嵌套列表）来为所需张量中的每个元素赋予确定值 1torch.tensor([[2,1,4,3],[1,2,3,4],[4,3,2,1]]) 常见的标准算术运算符都可以升级为按元素运算 123x &#x3D; torch.tensor([1.0,2,4,8])y &#x3D; torch.tensor([2,2,2,2])x+y, x-y, x*y, x&#x2F;y, x**y 按元素方式应用更多的计算（指数运算） 1torch.exp(x) 把多个张量连结在一起（在第0维、第1维） 123X &#x3D; torch.arange(12, dtype&#x3D;torch.float32).reshape((3,4))Y &#x3D; torch.tensor([[2.0,1,4,3],[1,2,3,4),[4,3,2,1]])tensor.cat((X,Y),dim&#x3D;0), torch.cat((X,Y),dim&#x3D;1) 通过逻辑运算符构建二元张量 1X &#x3D;&#x3D; Y 对张量中的所有元素进行求和会产生一个只有一个元素的张量 1X.sum() 即使形状不同，仍然可以通过调用广播机制(broadcasting mechanism)来执行按元素操作 123a &#x3D; torch.arange(3).reshape((3,1))b &#x3D; torch.arange(2).reshape((1,2))a, b, a+b 可以用[-1]选择最后一个元素，用[1:3]选择第二个和第三个元素（第1个、第2个元素） 1X[-1], Y[1:3] 除读取外，还可以通过指定索引来将元素写入矩阵 1X[1,2] &#x3D; 9 为多个元素赋相同的值，只需索引所有元素然后为其赋值 12X[0:2,:] &#x3D; 12X 运行一些操作可能导致新结果分配内存 123before &#x3D; id(Y)Y &#x3D; Y+Xid(Y) &#x3D;&#x3D; before 执行原地操作 1234Z &#x3D; torch.zeros_like(Y)print(&#39;id(Z):&#39;, id(Z))Z[:] &#x3D; X+Yprint(&#39;id(Z):&#39;, id(Z)) 若后续计算中美哟重复使用X，可以使用X[:] = X+Y或X += Y来减少操作的内存开销 123before &#x3D; id(X)X +&#x3D; Yid(X) &#x3D;&#x3D; before 转换为NumPy张量 123A &#x3D; X.numpy()B &#x3D; torch.tensor(A)type(A), type(B) 将大小为1的张量转换成Python标量 12a &#x3D; torch.tensor([3.5])a, a.item(), float(a), int(a) 5 数据预处理创建一个人工数据集，并存储在csv文件 12345678910import osos.makedirs(os.path.join(&#39;..&#39;, &#39;data&#39;), exist_ok&#x3D;True)data_file &#x3D; os.path.join(&#39;..&#39;, &#39;data&#39;, &#39;house_tiny.csv&#39;)with open(data_file, &#39;w&#39;) as f: f.write(&#39;NumRooms,Alley,Price\\n&#39;) f.write(&#39;NA,Pave,127500\\n&#39;) f.write(&#39;2,NA,106000\\n&#39;) f.write(&#39;4,NA,178100\\n&#39;) f.write(&#39;NA,NA,140000\\n&#39;) 从创建的csv文件中加载原始数据集 123456# 如果没有安装pandas，只需取消对以下行的注释：# !pip install pandasimport pandas as pddata &#x3D; pd.read_csv(data_file)print(data) 为处理缺失的数据，典型方法包括插值和删除，这里考虑差值方法 123inputs, outputs &#x3D; data.iloc[:, 0:2], data.iloc[:, 2]inputs &#x3D; inputs.fillna(inputs.mean())print(inputs) 对于 inputs 中的类别值或离散值，将 “NaN” 视为一个类别 12inputs &#x3D; pd.get_dummies(inputs, dummy_na&#x3D;True)print(inputs) 现在 inputs 和 outputs 中的所有条目都是数值类型，它们可以转换为张量格式 1234import torchX, y &#x3D; np.array(inputs.values), torch.tensor(outputs.values)X, y 其他：reshape？？？ 1234a &#x3D; torch.arange(12)b &#x3D; a.reshape((3,4))b[:] &#x3D; 2a 其他：tensor（数学概念，张量，深度学习框架作者数学不太行混用的）和array（计算机概念，数组，ndarray是多维数组） 5 线性代数5.1 向量 点乘：$a^{\\top} b=\\sum_{i} a_{i} b_{i}$ 正交：$a^{\\top} b=\\sum_{i} a_{i} b_{i}=0$ 5.2 矩阵 乘法（矩阵乘以向量）：$c=A b$ where $c_{i}=\\sum_{j} A_{i j} b_{j}$ 乘法（矩阵乘以矩阵）：$C=A B$ where $C_{i k}=\\sum_{j} A_{i j} B_{j k}$ 范数：$c=A \\cdot b$ hence $|c| \\leq|A| \\cdot|b|$ 矩阵范数：最小的满足上面公式的值 Frobenius范数：$|A|{\\text {Frob }}=\\left[\\sum{i j} A_{i j}^{2}\\right]^{\\frac{1}{2}}$ 特殊矩阵 对称和反对称：$A_{i j}=A_{j i}$ and $A_{i j}=-A_{j i}$ 正定矩阵：$|x|^{2}=x^{\\top} x \\geq 0$ generalizes to $x^{\\top} A x \\geq 0$ 正交矩阵：$U U^{\\top}=\\mathbf{1}$ 置换矩阵：$P$ where $P_{i j}=1$ if and only if $j=\\pi(i)$ 特征向量和特征值：特征向量是不被矩阵改变方向的向量，对称矩阵总能找到特征向量 5.3 线性代数实现标量由只有一个元素的张量表示 12345import torchx &#x3D; torch.tensor([3.0])y &#x3D; torch.tensor([2.0])x+y, x*y, x&#x2F;y, x**y 可将向量视为标量值组成的列表 12x &#x3D; torch.arange(4)x 通过张量的索引来访问任一元素 1x[3] 访问张量的长度 1len(x) 只有一个轴的张量，形状只有一个元素 1x.shape 通过指定两个分量m和n来创建一个形状为m×n的矩阵 12A &#x3D; torch.arange(20).reshape(5,4)A 矩阵的转置 1A.T 对称矩阵(symmetric matrix)A等于其转置：$\\mathbf{A}=\\mathbf{A}^{\\top}$ 123B &#x3D; torch.tensor([[1,2,3],[2,0,4],[3,4,5]])BB &#x3D;&#x3D; B.T 构建具有更多轴的数据结构 12X &#x3D; torch.arange(24).reshape(2,3,4)X 给定具有相同形状的任何两个张量，任何按元素二元计算的结果都将是相同形状的张量 123A &#x3D; torch.arange(20, dtype.float32).reshape(5,4)B &#x3D; A.clone()A, A+B 两个矩阵的按元素乘法称为哈达玛积(Hadamard product)（数学符号⊙） 1234A * Ba &#x3D; 2X &#x3D; torch.arange(24).reshape(2,3,4)a+X, (a*X).shape 计算其元素的和 12x &#x3D; torch.arange(4, dtype&#x3D;torch.float32)x, x.sum() 表示任意形状张量的元素和 12A &#x3D; torch.arange(20*2).reshape(2,5,4)A.shape, A.sum() 指定求和汇总张量的轴 12345678A_sum_axis0 &#x3D; A.sum(axis&#x3D;0)A_sum_axis0, A_sum_axis0.shapeA_sum_axis1 &#x3D; A.sum(axis&#x3D;1)A_sum_axis1, A_sum_axis1.shapeA.sum(axis&#x3D;[0,1])A.sum(axis&#x3D;[0,1]).shape 一个与求和相关的量是平均值(mean/average) 12A.mean(), A.sum(), A.numel()A.mean(axis&#x3D;0), A.sum(axis&#x3D;0)&#x2F;A.shape[0] 计算总和或均值保持轴数不变 12sum_A &#x3D; A.sum(axis&#x3D;1, keepdims&#x3D;True)sum_A 通过广播将A除以sum_A 1A&#x2F;sum_A 点积是相同位置的按元素乘积的和 12y &#x3D; torch.ones(4, dtype&#x3D;torch.float32)x, y, torch.dot(x,y) 也可以通过执行按元素乘法，然后进行求和来表示两个向量的点积 1torch.sum(x*y) 矩阵向量积Ax是一个长度为m的列向量，其$i^{\\text {th }}$元素是点积$\\mathbf{a}_{i}^{\\top} \\mathbf{x}$ 1A.shape, x.shape, torch.mv(A,x) 可以将矩阵乘法AB看作是简单执行m次矩阵-向量积，然后将结果拼接在一起，形成一个n×m矩阵 12B &#x3D; torch.ones(4,3)torch.mm(A,B) $L_{2}$范数是向量元素平方和的平方根：$|\\mathbf{x}|{2}=\\sqrt{\\sum{i=1}^{n} x_{i}^{2}}$ 12u &#x3D; torch.tensor([3.0,-4.0])torch.norm(u) 矩阵的弗罗贝尼乌斯范数(Frobenius norm)是矩阵元素的平方和的平方根：$|\\mathbf{X}|{F}=\\sqrt{\\sum{i=1}^{m} \\sum_{j=1}^{n} x_{i j}^{2}}$ 1torch.norm(torch.ones((4,9))) [补充]按特定轴求和 shape: [5,4] i.e., axis: 0,1 axis=0, sum: [4] axis=1, sum: [5] shape: [2,5,4] i.e., axis: 0,1,2 axis=1, sum: [2,4] axis=2, sum: [2,5] axis=[1,2], sum: [2] keepdims=True shape: [2,5,4] i.e., axis: 0,1,2 axis=1, sum: [2,1,4] axis=[1,2], sum: [2,1,1] 1234567891011import torcha &#x3D; torch.ones((2,5,4))a.shapea.sum(axis&#x3D;0).shapea.sum(axis&#x3D;1).shapea.sum(axis&#x3D;[0,2]).shapea.sum(axis&#x3D;1,keepdims&#x3D;True).shapea.sum(axis&#x3D;[0,2],keepdims&#x3D;True).shape 问题：torch不区分行向量和列向量吗？一个数学概念的向量对计算机来讲就是一个一维数组，可以用一个二维矩阵来区分行向量和列向量 行向量：矩阵的行数为1，列数为n 列向量：矩阵的行数为n，列数为1 6 矩阵计算6.1 标量导数——导数是切线的斜率没看/听懂 6.2 亚导数——将导数拓展到不可微的函数没看/听懂 6.3 梯度——将导数拓展到向量没看/听懂 6.4 拓展到矩阵没看/听懂","categories":[{"name":"CS&EE","slug":"CS-EE","permalink":"https://sunwucheng.com/wiki/categories/CS-EE/"}],"tags":[]},{"title":"Script","slug":"CS&EE/Script","date":"2020-03-31T16:00:00.000Z","updated":"2022-06-08T07:47:00.000Z","comments":true,"path":"20200401/","link":"","permalink":"https://sunwucheng.com/wiki/20200401/","excerpt":"","text":"Windows上bat批处理命令bat 批量删除文件名中的空格12345@echo offSetlocal Enabledelayedexpansionset &quot;str&#x3D; &quot;for &#x2F;f &quot;delims&#x3D;&quot; %%i in (&#39;dir &#x2F;b *.*&#39;) do (set &quot;var&#x3D;%%i&quot; &amp; ren &quot;%%i&quot; &quot;!var:%str%&#x3D;!&quot;) bat 批量删除文件名中的括号12345678@Echo Off&amp;SetLocal ENABLEDELAYEDEXPANSIONFOR %%a in (*) do (set &quot;name&#x3D;%%a&quot;set &quot;name&#x3D;!name:(&#x3D;!&quot;set &quot;name&#x3D;!name:)&#x3D;!&quot;ren &quot;%%a&quot; &quot;!name!&quot;)exit bat 批量替换文件名中的特殊符号（以下将”_”改为”.”）1234567@echo off&amp;setlocal enabledelayedexpansionfor &#x2F;f &quot;delims&#x3D;&quot; %%f in (&#39;dir &#x2F;b &#x2F;a-d *_*.*&#39;) do (if not &quot;%%f&quot;&#x3D;&#x3D;&quot;%0&quot; (set fn&#x3D;%%~nxfset fn&#x3D;!fn:_&#x3D;.!ren &quot;%%f&quot; &quot;!fn!&quot;)) bat 批量给文件名添加前缀字符1for %%i in (*.*) do ren &quot;%%i&quot; 前缀字符.&quot;%%i&quot; bat 批量删除文件名的末尾字符123456789@echo off::Deep Leesetlocal enabledelayedexpansionfor %%f in (*.wav) do ( *[注释]:这里的.wav,是你要指定批量处理的文件后缀名（可以根据不同后缀修改，例如pdf，txt，jpg等）*echo %%fset name&#x3D;%%fren !name! !name:~0,9%!.wav *[注释]:如果将9改为-5，则是从右向左删除5位，如果将9改为-6，则是从右向左删除6位，以此类推，（此处的.wav算4个字符，这里算是默认自动补齐了，实际上是先删后加的）)pause bat 批量删除/修改文件名中的某些字符串1234567891011121314151617@echo offset &#x2F;p str1&#x3D; 请输入要替换的文件(文件夹)名字符串（可替换空格）：set &#x2F;p str2&#x3D; 请输入替换后的文件(文件夹)名字符串（若删除直接回车）：echo.echo 正在操作中，请稍候……for &#x2F;f &quot;delims&#x3D;&quot; %%a in (&#39;dir &#x2F;s &#x2F;b ^|sort &#x2F;+65535&#39;) do (if &quot;%%~nxa&quot; neq &quot;%~nx0&quot; (set &quot;file&#x3D;%%a&quot;set &quot;name&#x3D;%%~na&quot;set &quot;extension&#x3D;%%~xa&quot;call set &quot;name&#x3D;%%name:%str1%&#x3D;%str2%%%&quot;setlocal enabledelayedexpansionren &quot;!file!&quot; &quot;!name!!extension!&quot; 2&gt;nulendlocal))exit bat 批量对文件名重命名12345678@echo offsetlocal enabledelayedexpansionset n&#x3D;1for &#x2F;f %%i in (&#39;dir &#x2F;b *&#39;) do (ren &quot;%%i&quot; A!n!.apkset &#x2F;a n+&#x3D;1)echo 批量重命名完成！ *[注释]:文件下所有文件都被命名成A1.apk、A2.apk、A3.apk…………pause bat 批量替换文件夹名称中的空格为指定字符1234567891011@echo offsetlocal enabledelayedexpansionfor &#x2F;f &quot;delims&#x3D;&quot; %%i in (&#39;dir &#x2F;ad&#x2F;b&#x2F;s^|sort &#x2F;r&#39;) do ( set b&#x3D;%%~nxi set b&#x3D;!b: &#x3D;_! *[注释]: &quot;set b&#x3D;!b: &#x3D;_!&quot; 将空格替换成&quot;_&quot;下划线 echo %%i echo !b! ren &quot;%%i&quot; !b! )endlocalexit Windows上用bat部署Hexo博客12@echo offstart cmd &#x2F;k &quot;cd&#x2F;d C:\\Users\\myth\\HexoPage &amp;&amp;hexo clean &amp;&amp;hexo g -d &amp;&amp;hexo clean &amp;&amp;taskkill &#x2F;f &#x2F;t &#x2F;im cmd.exe&quot; Mac上用bash部署Hexo博客123456789101112# hexopush.command#! &#x2F;bin&#x2F;bashcd &#x2F;Users&#x2F;myth&#x2F;sunwucheng.github.iohexo cleangit add .git commit -m &quot;automatic push&quot;git push origin hexohexo cleanhexo g -dhexo cleanosascript -e &#39;tell application &quot;Terminal&quot; to quit&#39; &amp;exit win7原版镜像注入USB3.0和nvme驱动如何让PPT导出的图片分辨率达到300dpi","categories":[{"name":"CS&EE","slug":"CS-EE","permalink":"https://sunwucheng.com/wiki/categories/CS-EE/"}],"tags":[]},{"title":"Linux","slug":"CS&EE/Linux","date":"2020-02-29T16:00:00.000Z","updated":"2022-03-26T01:39:24.608Z","comments":true,"path":"20200301/","link":"","permalink":"https://sunwucheng.com/wiki/20200301/","excerpt":"","text":"来源: Linux就该这么学 0 咱们先来谈谈学习方法和红帽系统0.3 开源共享精神 GNU GPL (GNU General Public License) BSD (Berkeley Software Distribution) Apache (Apache License Version) MPL (Mozilla Public License) MIT (Massachusetts Institute of Technology) 1 部署虚拟环境安装linux系统1.4 重置root用户密码12345678910111213# cat &#x2F;etc&#x2F;redhat-release &#x2F;&#x2F;确定是否为RHEL 7系统Red Hat Enterprise Linux Server release 7.0 (Maipo)# reboot &#x2F;&#x2F;重启系统e &#x2F;&#x2F;重启Linux系统主机并出现引导界面时，按下键盘上的e键进入内核编辑界面↑↓←→ &#x2F;&#x2F;在linux16参数这行的 最后面 追加“rd.break”参数Ctrl + X &#x2F;&#x2F;组合键运行修改过的内核程序，大约30秒过后，进入到系统的紧急求援模式mount -o remount,rw &#x2F;sysrootchroot &#x2F;sysrootpasswdtouch &#x2F;.autorelabelexitreboot 1.5 RPM (Red-Hat Package Manager) 红帽软件包管理器RPM = 源代码 + 安装规则 常用命令 对应命令格式 安装软件 rpm -ivh filename.rpm 升级软件 rpm -Uvh filename.rpm 卸载软件 rpm -e filename.rpm 查询软件描述信息 rpm -qpi filename.rpm 列出软件文件信息 rpm -qpl filename.rpm 查询文件属于哪个RPM rpm -qf filename 1.6 YUM软件仓库 (Yellow dog Updater, Modified)YUM = (源代码 + 安装规则) * N 命令 作用 yum repolist all 列出所有仓库 yum list all 列出仓库中所有软件包 yum info 软件包名称 查看软件包信息 yum install 软件包名称 安装软件包 yum reinstall 软件包名称 重新安装软件包 yum update 软件包名称 升级软件包 yum remove 软件包名称 移除软件包 yum clean all 清除所有仓库缓存 yum check-update 检查可更新的软件包 yum grouplist 查看系统中已经安装的软件包组 yum groupinstall 软件包组 安装指定的软件包组 yum groupremove 软件包组 移除指定的软件包组 yum groupinfo 软件包组 查询指定的软件包组信息 1.7 Systemd初始化进程Linux操作系统的开机过程: BIOS -&gt; Boot Loader -&gt; 加载系统内核 -&gt; 内核进行初始化 -&gt; 启动初始化进程红帽RHEL 7系统已经替换掉了熟悉的初始化进程服务System V init，正式采用全新的systemd初始化进程服务Linux系统启动时的初始化工作可看作一个个单元(Unit)，systemd用目标(target)代替System V init中运行级别的概念 System V init 运行级别 Systemd 目标名称 作用 0 runlevel0.target, poweroff.target 关机 1 runlevel1.target, rescue.target 单用户模式 2 runlevel2.target, multi-user.target 等同于级别3 3 runlevel3.target, multi-user.target 多用户的文本界面 4 runlevel4.target, multi-user.target 等同于级别3 5 runlevel5.target, graphical.target 多用户的图形界面 6 runlevel6.target, reboot.target 重启 emergency emergency.target 紧急Shell 12&#x2F;* 目录系统默认运行目标改为“多用户无图形”模式可用ln命令把多用户模式目标文件连接到&#x2F;etc&#x2F;systemd&#x2F;system&#x2F; *&#x2F;# ln -sf &#x2F;lib&#x2F;systemd&#x2F;system&#x2F;multi-user.target &#x2F;etc&#x2F;systemd&#x2F;system&#x2F;default.target System V init (RHEL6) systemctl (RHEL7) 作用 service foo start systemctl start foo.service 启动服务 service foo restart systemctl restart foo.service 重启服务 service foo stop systemctl stop foo.service 停止服务 service foo reload systemctl reload foo.service 重新加载配置文件(不终止服务) service foo status systemctl status foo.service 查看服务状态 chkconfig foo on systemctl enable foo.service 开机自动启动 chkconfig foo off systemctl disable foo.service 开机不自动启动 chkconfig foo systemctl is-enabled foo.service 查看特定服务是否为开机自启动 chkconfig –list systemctl list-unit-files –type=service 查看各级别下服务的启动禁用情况 systemd = 服务名称 systemctl = 配置工具 2 新手必须掌握的Linux命令2.1 强大好用的SHELL计算机硬件通常由运算器、控制器、存储器、输入/输出设备等共同组成，系统内核让各硬件设备各司其职且协同运行Linux系统内核负责对硬件资源分配、调度等管理任务，建议用户基于系统调用接口开发出的程序或服务来管理计算机Users ⇦Shell⇨ Procedure &amp; Service { System Call Interface [ Kernel ( Hardware ) ] }Shell(终端/壳)充当人与内核/硬件之间的翻译官，主流Linux系统默认终端为Bash(Bourne-Again SHell)解释器 2.2 执行查看帮助命令Linux命令的格式: 命令名称 [命令参数] [命令对象] 命令参数: 可以用长格式(完整的选项名称man --help)，也可以用短格式(单个字母的缩写man -h) 命令对象: 一般是指要处理的文件、目录、用户等资源 man man [命令]查看命令的帮助信息 按键 用处 空格键 向下翻一页 PaGe down 向下翻一页 PaGe up 向上翻一页 home 直接前往首页 end 直接前往尾页 / 从上至下搜索某个关键词，如/linux ? 从下至上搜索某个关键词，如?linux n 定位到下一个搜索到的关键词 N 定位到上一个搜索到的关键词 q 退出帮助文档 结构名称 代表意义 NAME 命令的名称 SYNOPSIS 参数的大致使用方法 DESCRIPTION 介绍说明 EXAMPLES 演示(附带简单说明) OVERVIEW 概述 DEFAULTS 默认的功能 OPTIONS 具体的可用选项(带介绍) ENVIRONMENT 环境变量 FILES 用到的文件 SEE ALSO 相关的资料 HISTORY 维护历史与联系方式 2.3 常用系统工作命令 echo 在终端输出字符串或变量提取后的值，格式为echo [字符串]/[$变量] date 显示及设置系统的时间或日期，格式为date [选项] [+指定的格式] reboot 重启系统，其格式为reboot poweroff 关闭系统，其格式为poweroff wget 在终端中下载网络文件，格式为wget [参数] 下载地址 ps 查看系统中的进程状态，格式为ps [参数] top 动态地监视进程活动与系统负载等信息，其格式为top pidof 查询某个指定服务进程的PID值，格式为pidof [参数] [服务名称] kill 终止某个指定PID的服务进程，格式为kill [参数] [进程PID] killall 终止某个指定名称的服务所对应的全部进程，格式为killall [参数] [服务名称] 2.4 系统状态检测命令 ifconfig 用于获取网卡配置与网络状态等信息，格式为ifconfig [网络设备] [参数] uname 查看系统内核与系统版本等信息，格式为uname [-a] uptime 查看系统的负载信息，格式为uptime free 显示当前系统中内存的使用量信息，格式为free [-h] who 查看当前登入主机的用户终端信息，格式为who [参数] last 查看所有系统的登录记录，格式为last [参数] history 显示历史执行过的命令，格式为history [-c] sosreport 收集系统配置及架构信息并输出诊断文档，格式为sosreport 2.5 工作目录切换命令 pwd 显示用户当前所处的工作目录，格式为pwd [选项] cd 切换工作路径，格式为cd [目录名称] ls 显示目录中的文件信息，格式为ls [选项] [文件] cd . 切换到当前目录 cd .. 切换到上一级目录 cd或cd ~ 切换到该用户家目录 cd - 切换到上一次目录 ls -a 看到全部文件（包括隐藏文件） ls -l 查看文件的属性、大小等详细信息 ls -ld [目录名称] 查看目录属性信息 2.6 文本文件编辑命令 cat 查看纯文本文件(内容较少的)，格式为cat [选项] [文件] more 查看纯文本文件(内容较多的)，格式为more [选项] [文件] head 查看纯文本文档的前N行，格式为head [选项] [文件] tail 查看纯文本文档的后N行或持续刷新内容，格式为tail [选项] [文件] tr 替换文本文件中的字符，格式为tr [原始字符] [目标字符] wc 统计指定文本的行数、字数、字节数，格式为wc [参数] 文本 stat 查看文件的具体存储信息和时间等信息，格式为stat 文件名称 cut 按列提取文本字符，格式为cut [参数] 文本 diff 比较多个文本文件的差异，格式为diff [参数] 文件 2.7 文件目录管理命令 touch 创建空白文件或设置文件的时间，格式为touch [选项] [文件] mkdir 创建空白的目录，格式为mkdir [选项] 目录 cp 复制文件或目录，格式为cp [选项] 源文件 目标文件 mv 剪切文件或将文件重命名，格式为`mv [选项] 源文件 [目标路径 rm 删除文件或目录，格式为rm [选项] 文件 dd 按照指定大小和个数的数据块来复制文件或转换文件，格式为dd [参数] file 查看文件的类型，格式为file 文件名 2.8 打包压缩与搜索命令 tar 对文件进行打包压缩或解压，格式为tar [选项] [文件] grep 在文本中执行关键词搜索，并显示匹配的结果，格式为grep [选项] [文件] find 按照指定条件来查找文件，格式为find [查找路径] 寻找条件 操作 3 管道符、重定向与环境变量。4 Vim编辑器与Shell命令脚本。5 用户身份与文件权限。6 存储结构与磁盘划分7 使用RAID与LVM磁盘阵列技术8 Iptables与Firewalld防火墙9 使用ssh服务管理远程主机10 使用Apache服务部署静态网站11 使用Vsftpd服务传输文件12 使用Samba或NFS实现文件共享13 使用Bind提供域名解析服务14 使用DHCP动态管理主机地址15 使用Postfix与Dovecot部署邮件系统16 使用Squid部署代理缓存服务17 使用iSCSI服务部署网络存储18 使用MariaDB数据库管理系统19 使用PXE+Kickstart无人值守安装服务20 使用LNMP架构部署动态网站环境","categories":[{"name":"CS&EE","slug":"CS-EE","permalink":"https://sunwucheng.com/wiki/categories/CS-EE/"}],"tags":[]},{"title":"Git","slug":"CS&EE/Git","date":"2020-01-31T16:00:00.000Z","updated":"2022-03-24T02:21:31.810Z","comments":true,"path":"20200201/","link":"","permalink":"https://sunwucheng.com/wiki/20200201/","excerpt":"","text":"来源: Git教程 - 廖雪峰的官方网站 安装Git12&#x2F;* Ubuntu上安装 *&#x2F;$ sudo apt-get install git 创建版本库/仓库版本库/仓库相当于一个目录, 目录中所有文件修改、删除都可被Git追踪和管理工作区working directory ⊃ 版本库repository ⊃ 暂存区stage + 分支master(⊃HEAD) 1234$ mkdir git-repository &#x2F;&#x2F;创建版本库$ cd git-repository &#x2F;&#x2F;转到版本库$ git init &#x2F;&#x2F;初始化版本库&#x2F;* 初始化后, 目录中生成了一个.git目录, 它用来跟踪管理此版本库 *&#x2F; 版本库文件操作12345678910111213141516171819202122232425262728293031323334353637$ vim XXX.txt &#x2F;&#x2F;创建并编辑文件$ git add XXX.txt &#x2F;&#x2F;添加文件到仓库$ git commit -m &quot;add XXX&quot; &#x2F;&#x2F;提交添加到仓库(加备注说明)$ git status &#x2F;&#x2F;查看仓库当前状态$ touch XXX.txt$ vim XXX.txt $ git status &#x2F;* &#96;Changes not staged for commit&#96; &#x3D; 工作区文件有修改待添加 *&#x2F; $ git add XXX.txt $ git status &#x2F;* &#96;Changes to be committed:&#96; &#x3D; 缓冲区文件有添加待提交 *&#x2F;$ git commit -m &quot;add XXX&quot; $ git status&#x2F;* &#96;nothing to commit, working tree clean&#96; &#x3D; 仓库目录干净 *&#x2F;$ rm XXX.txt$ git status&#x2F;* &#96;Changes not staged for commit&#96; &#x3D; 工作区文件有修改待添加 *&#x2F;$ git rm或add XXX.txt$ git commit -m &quot;remove XXX.txt&quot;$ vim XXX.txt $ git checkout -- XXX.txt &#x2F;&#x2F;丢弃工作区的修改, 回到最近一次commit或add时的状态$ vim XXX.txt $ git add XXX.txt$ git reset HEAD XXX.txt &#x2F;&#x2F;撤销(unstage)暂存区的修改, 重新放回工作区$ git diff XXX.txt &#x2F;&#x2F;查看文件的修改$ git diff HEAD -- XXX.txt &#x2F;&#x2F;查看工作区和版本库里面最新版本的区别$ git log &#x2F;&#x2F;显示从最近到最远的提交日志$ git log --pretty&#x3D;oneline &#x2F;&#x2F;显示从最近到最远的简要提交日志$ git reset --hard HEAD^ &#x2F;&#x2F;回退到上一个版本$ git reset --hard HEAD~n &#x2F;&#x2F;往上回退n个版本$ git reset --hard &lt;commit&gt; &#x2F;&#x2F;指定回到某个版本(根据版本号)$ git reflog &#x2F;&#x2F;查看记录的每一次命令 远程仓库123456789101112131415$ ssh-keygen -t rsa -C &quot;youremail@example.com&quot; &#x2F;&#x2F;-t(加密方式); -C(备注信息)$ cat &#x2F;Users&#x2F;$USER&#x2F;.ssh&#x2F;id_rsa.pub&#x2F;* Github -&gt; Account settings -&gt; Add SSH Key -&gt; Ctrl+V *&#x2F;$ cd git-repository$ git remote add origin git@server-name:path&#x2F;repo-name.git$ git push -u origin master &#x2F;&#x2F;-u(关联本地与远程的分支)$ vim XXX.txt;$ git add XXX.txt$ git commit -m &quot;add XXX&quot;$ git push origin master $ mkdir git-newrepository$ cd git-newrepository$ git clone git@server-name:path&#x2F;repo-name.git 分支管理123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778step1: $ git branch dev &#x2F;&#x2F;创建dev分支step2: $ git checkout dev &#x2F;&#x2F;转到dev分支equal: $ git checkout -b dev &#x2F;&#x2F;创建并切换到新分支equal: $ git switch -c dev &#x2F;&#x2F;创建并切换到新分支(新版本git提供switch切换命令)$ git branch &#x2F;&#x2F;查看当前分支$ vim XXX.txt$ git checkout或switch master &#x2F;&#x2F;转到已有master分支(新版本git提供switch切换命令)$ cat XXX.txt$ git merge (--no-ff -m &quot;...&quot;) dev &#x2F;&#x2F;(非快速)合并指定分支到当前分支$ cat XXX.txt$ git branch -d dev &#x2F;&#x2F;删除dev分支(快速模式在删除分支后分支信息会丢失)$ git switch -c dev$ vim XXX.txt$ git add XXX.txt$ git commit -m &quot;in n line&quot; &#x2F;&#x2F;修改XXX文件dev分支第n行$ git switch master$ vim XXX.txt$ git add XXX.txt$ git commit -m &quot;in n line&quot; &#x2F;&#x2F;修改XXX文件master分支第n行$ git merge dev &#x2F;&#x2F;合并dev分支到master分支: 无法快速合并$ cat XXX.txt &#x2F;&#x2F;可直接查看冲突内容$ vim XXX.txt &#x2F;&#x2F;修改好冲突内容$ git add XXX.txt$ git log --graph --pretty&#x3D;oneline --abbrev-commit &#x2F;&#x2F;查看分支合并情况(合并图)$ git branch -d dev &#x2F;&#x2F;删除dev分支$ git commit -m &quot;conflict fixed&quot; &#x2F;&#x2F;合并完成$ git branch dev$ vim XXX.txt$ git status$ git stash &#x2F;&#x2F;把当前工作现场&quot;储藏&quot;起来$ git checkout master$ git checkout -b issue-101$ vim readme.txt$ git add readme.txt$ git commit -m &quot;fix bug 101&quot;$ git switch master$ git merge --no-ff -m &quot;merge bug fix 101&quot;$ git switch dev$ git status$ git stash list &#x2F;&#x2F;查看&quot;储藏&quot;的工作现场$ git stash pop &#x2F;* &#x3D; $ git stash apply + $ git stash drop; $ git stash apply stash@&#123;0&#125; *&#x2F;$ git stash list$ git branch$ git cherry-pick &lt;commit&gt;$ git switch -c feature &#x2F;&#x2F;添加新功能分支$ git add valcan.py$ git status$ git commit -m &quot;add feature vulcan&quot;$ git switch dev$ git branch -d feature$ git branch -D feature$ cd &#x2F;original-git$ git remote (-v)$ git push origin master$ git push origin dev$ cd &#x2F;another-git &#x2F;&#x2F;多用户分支$ git clone git@server-name:path&#x2F;repo-name.git$ git branch$ git checkout -b dev origin&#x2F;dev$ git add env.txt$ git commit -m &quot;add env&quot;$ git push origin dev$ cd &#x2F;original-git$ git add env.txt$ git commit -m &quot;add new env&quot;$ git push origin dev$ git pull$ git branch --set-upstream-to&#x3D;origin&#x2F;dev dev$ git pull$ git commit -m &quot;fix env conflict&quot;$ git rebase &#x2F;&#x2F;把本地未push的分叉提交历史整理成直线 标签管理tag就是一个让人容易记住的有意义的名字，它跟某个commit绑在一起 1234567891011$ git branch$ git checkout master$ git tag &lt;tag&gt; &#x2F;&#x2F;添加标签$ git tag -a &lt;tag&gt; -m &quot;description&quot; &lt;commit&gt;$ git tag &#x2F;&#x2F;查看标签 $ git show &lt;tag&gt; &#x2F;&#x2F;查看某标签信息$ git tag -d &lt;tag&gt; &#x2F;&#x2F;删除标签$ git push origin &lt;tag&gt; &#x2F;&#x2F;推送某标签到远程$ git push origin --tags &#x2F;&#x2F;推送所有标签到远程$ git tag -d &lt;tag&gt; &#x2F;&#x2F;删除远程标签step1$ git push origin :refs&#x2F;tags&#x2F;&lt;tag&gt; &#x2F;&#x2F;删除远程标签step2 自定义git12345678910111213141516171819202122232425$ git config --global color.ui true &#x2F;&#x2F;让Git显示颜色$ git touch .gitignore $ vim .gitignore $ git add .gitignore$ git commit -m &quot;add .gitignore&quot;$ git status$ git add XXX.xxx$ git add -f XXX.xxx$ git check-ignore -v XXX.xxx$ git config (--global) alias.xxx XXX或&quot;XXX XXX&quot;&#x2F;* --global参数是全局参数, 加则对电脑所有Git仓库都有用, 不加则只针对当前的仓库起作用 *&#x2F;$ ssh root@xxxx.xxxx.xxxx.xxxx &#x2F;&#x2F;搭建Git服务器$ sudo apt-get install git $ sudo adduser git$ vim &#x2F;home&#x2F;git&#x2F;.ssh&#x2F;authorized_keys$ cd &#x2F;srv$ sudo git init --bare sample.git$ sudo chown -R git:git sample.git$ vim &#x2F;etc&#x2F;passwd&#x2F;* git:x:1001:1001:,,,:&#x2F;home&#x2F;git:&#x2F;bin&#x2F;bash -&gt; ...:&#x2F;home&#x2F;git:&#x2F;usr&#x2F;bin&#x2F;git-shell *&#x2F;$ exit$ git clone git@server:&#x2F;srv&#x2F;sample.git 使用SourceTree","categories":[{"name":"CS&EE","slug":"CS-EE","permalink":"https://sunwucheng.com/wiki/categories/CS-EE/"}],"tags":[]},{"title":"C","slug":"CS&EE/C","date":"2019-12-31T16:00:00.000Z","updated":"2022-03-24T01:30:46.716Z","comments":true,"path":"20200101/","link":"","permalink":"https://sunwucheng.com/wiki/20200101/","excerpt":"","text":"来源: C Primer Plus 1 初识C语言1.6 语言标准 1978 1989 1990 1994 2011 K&amp;R C ANSI C (C89) ISO C (C90) C99 C11 1.8 编程机制源代码文件(source code file): 文件名=基本名(basename).扩展名(extension)C编程: 源代码(by编译) -&gt; 中间代码(by链接: + 库代码&amp;启动代码) -&gt; 可执行代码 编译平台 编译工具 编译命令 UNIX cc XXX.c GNU GCC gcc -std=c99/c1x/c11 XXX.c LLVM Clang clang -std=c99/c1x/c11 XXX.c Linux GCC gcc XXX.c 2 C语言概述2.2 结构解释12345&#x2F;* C程序结构 *&#x2F;#include &#x2F;&#x2F;预处理指令(preprocessor directive)) -&gt; 预处理(processing)int main(void) &#x2F;&#x2F;main()总是第一个被调用的函数function a() &#x2F;&#x2F;组成函数的语句function b() &#x2F;&#x2F;组成函数的语句 C语言元素: 关键字 标识符 运算符 数据 C语言语句(6种): 标号语句 复合语句 表达式语句 选择语句 迭代语句 跳转语句 12345678910&#x2F;* 一个简单的程序 *&#x2F; #include &lt;stdio.h&gt; &#x2F;&#x2F;头文件(header): 包含另一个文件int main(void) &#x2F;&#x2F;函数头&#123; &#x2F;&#x2F;函数体开始 int num; &#x2F;&#x2F;声明(declaration) num &#x3D; 1; &#x2F;&#x2F;赋值表达式语句 printf(&quot;The number is %d.\\n&quot;, num); &#x2F;&#x2F;调用一个函数 return 0; &#x2F;&#x2F;return语句&#125; &#x2F;&#x2F;函数体结束 头文件: 通常指C程序顶部的信息集合，经常包含编译器创建最终可执行程序要用到的信息 如定义常量或指明函数名及其如何使用，但函数的实际代码在一个预编译代码的库文件中 函数: C程序包含一个或多个函数, 他们是C程序的基本模块; 函数由函数头和函数体组成 函数头: 包含函数名、传入函数的信息类型和函数的返回类型 函数头: 通过函数名后面的圆括号()可识别函数, 圆括号里可能为空也可能有参数 函数体: 被花括号括起来, 由一系列语句、声明组成 main()函数: int和void是ANSI C定义main()的一部分, ANSI C之前的编译器需省略void int main(void) 标准形式写法, 移植到不同编译器不会出什么问题 main() 此形式C90勉强接受, C99和C11标准不允许这样写 void main() 此形式一些编译器允许这样写, 但所有标准都未认可 声明: 为变量指定变量名, 并标识该变量中储存的数据类型; C语言中所有变量须先声明才能使用 C99之前的C语言要求把变量声明在块的顶部, 其他语句不能出现在任何声明之前 C99和C11遵循C++惯例, 可把声明放在块中的任何位置, 当然变量使用前还是一定要先声明 赋值: C语言通过赋值运算符而不是赋值语句完成赋值操作, C语言没有所谓”赋值语句” printf()函数: \\n让计算机另起一行，%d告诉计算机以何种形式、在何处输出打印num值 参数意指传递给函数的信息 实参(实际参数, actual argument)是传递给函数的特定值; 形参(形式参数)是函数中用于储存值的变量; 转义序列(escape sequence)用于代表难以表示或无法输入的字符 return语句: 有返回值的C函数要有return语句; return语句是一种跳转语句 命名: 可以用小写字母、大写字母、数字、下划线来命名; 第一个字符不能是数字; 区分大小写; 注意代码可读性 C99和C11根据通用字符名(UCN)机制添加了扩展字符集, 包含了除英文字母以外的部分字符 C99和C11允许更长的标识符名, 但编译器只识别前63个字符; 外部标识符只允许使用31个字符 C90只允许6个字符, 旧式编译器只允许使用8个字符 2.6 多个函数1234567891011121314151617&#x2F;* two_func.c -- 一个文件中包含两个函数 *&#x2F;#include &lt;stdio.h&gt;void butler(void); &#x2F;* ANSI&#x2F;ISO C 函数原型(prototype) *&#x2F;int main(void)&#123; printf(&quot;HAHAHAHAHAHAHA.\\n&quot;); butler(); &#x2F;* 函数调用(function call) *&#x2F; printf(&quot;Yes.\\n&quot;); return 0;&#125;void butler(void) &#x2F;* 函数定义(function definition) *&#x2F;&#123; printf(&quot;Are you crazy?\\n&quot;);&#125; 函数声明(function declaration): void butler(); 早期C语言的函数声明, 只需指定返回类型, 不用描述参数 C90 C99 C11标准都承认旧版本形式, 但它会逐步被淘汰 函数原型(prototype): void butler(void); C90新增了函数原型, 指明了函数的属性: 函数返回值, 函数描述参数 标准include文件(包含文件)为标准库函数提供了函数原型, 如stdio.h文件包含了printf()的函数原型 函数执行: 无论在什么地方所有C程序都从main()开始执行, 但惯例把main()放开头, 因为它提供了程序的基本框架 2.8 关键字和保留标识符 auto break case char const continue default do double else enum estern float for goto if inline int long register restrict return short signed sizeof static struct switch typeof union unsigned void while _Alignas _Aligof _Atomic _Bool _Complex _Generic _Imaginary _Noreturn _Static_assert _Thred_local 粗体 表示C90标准新增的关键字； 斜体 表示C99标准新增的关键字； 粗斜体 表示C11标准新增的关键字 3 数据和C3.1 示例程序123456789101112131415#include &lt;stdio.h&gt;int main(void)&#123; float weight; float value; printf(&quot;Are you worth your weight in platinum?\\n&quot;); printf(&quot;Let&#39;s check it out.\\n&quot;); printf(&quot;Please enter your weight in pounds: &quot;); scanf(&quot;%f&quot;, &amp;weight); value &#x3D; 1700.0 * weight * 14.5833; printf(&quot;Your weight in platinum is worth $%.2f.\\n&quot;, value); printf(&quot;You are easily worth that! If platinum prices drop,\\n&quot;); printf(&quot;eat more to maintain your value.\\n&quot;); return 0;&#125; 浮点数类型float可以储存带小数的数字，以便处理更大范围的数据 scanf()读取键盘的输入: %f说明要读取的是浮点数 &amp;weight告诉scanf()把输入的值赋给weight变量，即用&amp;表明找到weight变量的地点 printf()进行信息的输出 %.2f中的.2用于精确控制输出，即指定输出的浮点数只显示小数点后两位 printf()语句把输出发送到一个叫作缓冲区(buffer)得到中间存储区域在缓冲区满或遇到换行字符或需要输入时, 缓冲区中的内容再不断被发送到屏幕上 刷新缓冲区: 从缓冲区把数据发送到屏幕或文件 3.2 变量和常量数据 数据: 承载信息的数字和字符 常量(constant): 数据类型在程序使用之前已经预设好了，在整个程序运行过程中没有变化的数据 变量(variable): 数据类型在程序运行期间可能改变或被赋值的数据 3.3 数据: 数据类型关键字 位(bit) 可以储存0或1 字节(byte) char类型占用的位(bit)数, 通常1字节均为8位 字(word) 设计计算机时给定的自然存储单位 int (加signed、unsigned、short、long、long long) 表示基本的整数类型 char 指定字母和其它字符(# $ % * ...)，以及较小的整数 float double long double 表示带小数点的数 _Bool 表示布尔值(true or false) _Complex 表示复数 _Imaginary 表示虚数 整数类型: 没有小数部分, 计算机中整数以二进制数字储存浮点数类型: 有小数部分, 同数学中的实数, 计算机中浮点数分开为小数部分和指数部分表示和储存 3.4 C语言基本数据类型12345678910111213#include &lt;stdio.h&gt;int main(void)&#123; printf(&quot;Type char has a size of %zd bytes.\\n&quot;, sizeof(char)); printf(&quot;Type short has a size of %zd bytes.\\n&quot;, sizeof(short)); printf(&quot;Type int has a size of %zd bytes.\\n&quot;, sizeof(int)); printf(&quot;Type long has a size of %zd bytes.\\n&quot;, sizeof(long)); printf(&quot;Type long long has a size of %zd bytes.\\n&quot;, sizeof(long long)); printf(&quot;Type float has a size of %zd bytes.\\n&quot;, sizeof(float)); printf(&quot;Type double has a size of %zd bytes.\\n&quot;, sizeof(double)); printf(&quot;Type long double has a size of %zd bytes.\\n&quot;, sizeof(long double)); return 0;&#125; sizeof: C语言的内置运算符, 以字节为单位给出指定对象(类型/特定量)的大小 运算对象若是类型: 圆括号必不可少，应写成sizeof(char)形式 运算对象是特定量: 圆括号可有可无，可写成sizeof name或sizeof 6.28或sizeof(6.28) %zd: C99和C11提供%zd转换说明匹配sizeof的返回类型(size_t类型) %zd: 一些不支持C99和C11的编译器可用%u或%lu代替%zd 3.4.1 int类型 声明: 为变量赋于名称并分配内存空间 初始化: 为变量赋一个初始值 进制表示: 通常假定整形常量为十进制，0前缀表示八进制，0x或0X前缀表示十六进制 整形常量/整形字面量: 类型 十六进制 八进制 十进制 char \\0x41 \\0101 N.A. int 0x41 0101 65 unsigned int 0x41u 0101u 65u long 0x41L 0101L 65L unsigned long 0x41UL 0101UL 65UL long long 0x41LL 0101LL 65LL unsigned long long 0x41ULL 0101ULL 65ULL 整型显示: printf()转换说明 %d 十进制显示; %(#)o **八进制(前缀)**显示; %(#)x **十六进制(前缀)**显示 转换说明: printf()函数中的转换说明决定了数据的显示方式, 而不是数据的储存方式 转换说明: printf()函数中转换说明的数量应与待打印值(int类型的变量/常量，值为int类型的表达式)的数量相等 转换说明: C虽然允许使用大写或小写的多常量后缀, 但是在转换说明中只能用小写 3.4.3 char类型 表示: 字符以数值形式储存, 计算机在内存中用数值编码来表示字符(C支持常用的ASCII码及其他编码) 类型: C90标准中C语言允许在关键词char前使用signed和unsigned表示有/无符号类型 初始化: 可使用数字代码值或字符常量来赋值 变量名: 没有引号的(单个)字符 字符常量(character constant): 计算机系统使用数值编码的的符号表示，表示为单引号括起来的字符 字符串: 用双括号括起来的(单个)字符 字符串: 无论普通字符还是转义序列, 只要是双引号括起来颚的字符合集, 就无须用单引号括起来 打印字符 123456789#include &lt;stdio.h&gt;int main()&#123; char ch; printf(&quot;Please enter a character.\\n&quot;); scanf(&quot;%c&quot;, &amp;ch); printf(&quot;The code for %c is %d.\\n&quot;, ch, ch); return 0;&#125; 非打印字符 ASCII码表示: char beep = 7; 转义序列表示: char nerf = &#39;\\n&#39;; 转义序列(escape sequence) 转义序列 含义 \\a 警报(ANSI C) \\b 退格 \\f 换页(把活跃位置移至下一页的开始处)(打印机上) \\n 换行(把活跃位置移至下一行的开始处) \\r 回车(把活跃位置移至当前行的开始处) \\t 水平制表符(把活跃位置移至下一个水平制表点)(打印机上) \\v 垂直制表符(把活跃位置移至下一个垂直制表点) \\ 反斜杠() &#39; 单引号 &quot; 双引号 ? 问号 \\0oo 八进制值(oo必须是有效的八进制数, 即每个o可表示0～7中的一个数) \\xhh 十六进制值(hh必须是有效的十六进制数, 即每个h可表示0～f中的一个数) C标准规定警报字符不得改变活跃位置(active position), 即显示设备中下一个字符将出现的位置 1234567891011#include &lt;stdio.h&gt;int main()&#123; float salary; printf(&quot;\\aEnter your desired monthly salary:&quot;); printf(&quot; $_______\\b\\b\\b\\b\\b\\b\\b&quot;); scanf(&quot;%f&quot;, &amp;salary); printf(&quot;\\n\\t$%.2f a month is $%.2f a year.&quot;, salary, salary * 12.0); printf(&quot;\\rGee!\\n&quot;); return 0;&#125; 3.4.4 _Bool 类型 C99标准添加了*_Bool类型，用于表示布尔值，即逻辑值true和false，原则上仅占用1位存储空间C语言用值1表示true，值0表示false，所以_Bool*类型实际也是一种整数类型 3.4.5 可移植类型: stdint.h和inttypes.h12345678910111213#include &lt;stdio.h&gt;#include &lt;inttypes.h&gt;int main(void)&#123; int32_t me32; me32 &#x3D; 45933945; printf(&quot;First, assume int32_t is int: &quot;); printf(&quot;me32 &#x3D; %d\\n&quot;, me32); printf(&quot;Next, let&#39;s not make any assumptions.\\n&quot;); printf(&quot;Instead, use a \\&quot;macro\\&quot; from inttypes.h: &quot;); printf(&quot;me32 &#x3D; %&quot; PRId32 &quot;\\n&quot;, me32); return 0;&#125; 精确宽度整数类型(exact-width integer type) 最小宽度类型(minimum width type): 保证所表示类型一定是至少有指定宽度的最小整数类型 最快最小宽度类型(fast minimum width type) 最大的无符号整数类型 3.4.6 浮点数类型: float、double、long double 浮点型常量: 默认情况编译器假定是double类型 加上f或F后缀覆盖为float类型 加上l或L覆盖为long double类型 十六进制表示浮点型常量(C99新增): 在十六进制数前加上十六进制前缀(0x或0X), 用p或P分别代替e和E 用2的幂代替10的幂(即p计数法) 123456789101112#include &lt;stdio.h&gt;int main()&#123; float aboat &#x3D; 32000.0; double abet &#x3D; 2.14e9; long double dip &#x3D; 5.32e-5; printf(&quot;%f can be written %e\\n&quot;, aboat, aboat); printf(&quot;And it&#39;s %a in hexadecimal, powers of 2 notation\\n&quot;, aboat); printf(&quot;%f can be written %e\\n&quot;, abet, abet); printf(&quot;%Lf can be written %Le\\n&quot;, dip, dip); return 0;&#125; 浮点值的上溢(overflow)和下溢(underflow) 上溢: 当计算导致数字过大, 超过当前类型能表达的范围 C语言规定给其赋一个表示无穷大的特定值 printf()显示该值为inf或infinity(或有无穷意义的其他内容) 下溢: 计算过程中损失了原本末尾有效位上的数字 低于正常的(subnormal)浮点值: 损失了类型全精度的浮点值 123456789#include &lt;stdio.h&gt;int main(void)&#123; float a, b; b &#x3D; 2.0e20 + 1.0; a &#x3D; b - 2.0e20; printf(&quot;%f \\n&quot;, a); return 0;&#125; 3.4.6 复数和虚数类型 复数类型和虚数类型的支持 C99标准支持复数类型和虚数类型, 但有所保留 一些独立实现(如嵌入式处理器的实现)就不需要使用复数和虚数(如VCR芯片不需要复数) 一般虚数类型都是可选项, C11标准把整个复数软件包都作为可选项 复数类型 float_Complex : 包含两个float类型的多值, 分别表示复数的实部和虚部 double_Complex long double_Complex 虚数类型 float_Imaginary double_Imaginary long double_Imaginary complex.h: 若包含该头文件，便可用complex代替_Complex，Imaginary代替_Imaginary，I代替-1的平方根 3.4.7 其他类型(由基本类型衍生): 数组、指针、结构、联合4 字符串和格式化输入/输出4.1 前导程序1234567891011121314151617181920212223&#x2F;* talkback.c —— 演示与用户交互 *&#x2F;#include &lt;stdio.h&gt;#include &lt;string.h&gt;#define DENSITY 62.4 &#x2F;&#x2F;用C预处理器把字符常量DENSITY定义为62.4int main()&#123; float weight, volume; int size, letters; char name[40]; &#x2F;&#x2F;用数组储存字符串 printf(&quot;Hi! What&#39;s your first name?\\n&quot;); scanf(&quot;%s&quot;, name); &#x2F;&#x2F;name没有&amp;前缀 （使用%s转换说明来处理字符串的输入和输出） printf(&quot;%s, what&#39;s your weight in pounds?\\n&quot;, name); scanf(&quot;%f&quot;, &amp;weight); &#x2F;&#x2F;weight有&amp;前缀 size &#x3D; sizeof name; letters &#x3D; strlen(name); &#x2F;&#x2F;用C函数strlen()获取字符串的长度 volume &#x3D; weight &#x2F; DENSITY; printf(&quot;Well, %s, your volume is %2.2f cubic feet.\\n&quot;, name, volume); printf(&quot;Also, your first name has %d letters,\\n&quot;, letters); printf(&quot;and we have %d bytes to store it.\\n&quot;, size); return 0;&#125; 4.2 字符串简介数组(array): 同类型数据元素的有序序列字符串(character string): 一个或多个字符的序列 e.g., &quot;I am your father!&quot;双引号&quot; &quot;不是字符串的一部分，仅用来告知编译器它扩起来的是字符串，正如单引号’’标识单个字符C语言没有专门用于储存字符串的变量类型，字符串都被储存在char类型的数组中 e.g., char name[40]; 空字符 I a m y o u r f a t h e r ! \\0 C语言用空字符(null character)标记字符串的结束，即字符串一定以空字符结束，占用数组最后一个储存单元有40个储存单元的字符串最多能储存39个字符，故字符串的数组容量必须至少比待存储字符串的字符数多1空字符不是数字0，而是非打印字符，其ASCII码值是(或等价于)0 1234567891011121314151617&#x2F;* sizeof运算符、strlen()函数返回的数据类型d的转换说明: %u或%lu(早期)，%zd(C99、C11新增) *&#x2F;#include &lt;stdio.h&gt;#include &lt;string.h&gt;# define PRAISE &quot;OMG U R the one.&quot;int main(void)&#123; char name[40]; printf(&quot;What&#39;s your name? &quot;); scanf(&quot;%s&quot;, name); printf(&quot;Your name of %zd letters &quot;, strlen(name)); printf(&quot;occupies %zd memory cells.\\n&quot;, sizeof name); printf(&quot;The phrase of praise has %zd letters &quot;, strlen(PRAISE)); printf(&quot;and occupies %zd memory cells.\\n&quot;, sizeof PRAISE); return 0;&#125; sizeof运算符: 以字节为单位给出对象的大小(字符串数组总的字节大小) strlen()函数: 给出字符串中的字符长度(字符串数组中字符信息的字节大小，不包括空字符) 4.3 常量和C预处理器符号常量(symbolic constant): 符号常量名命名规则与变量相同，但习惯使用大写表示，有时表示为带c_或k_前缀明示常量(manifest constant): C标准没有此概念，仅提到过#define最简单的用法是定义一个“明示常量”编译时替换(compile-time substitution): 预处理器可用来定义常量、字符和字符串常量等，格式#define NAME valueconst 限定符: const关键字用于限定一个变量为只读，如const int MONTHS = 12;，用起来比#define更灵活 4.4 printf()和scanf()4.4.1 printf()函数printf()函数使用的是值，无论是变量、常量还是表达式的值printf()函数使用%符号来标识转换说明转换说明(conversion specification): printf()函数打印数据的指令(须与待打印数据的类型相匹配)转换说明修饰符: 在%和转换字符之间插入修饰符可修饰基本的转换说明(插入多个应注意顺序、不是所有组合都行) 转换说明 输出 %a 浮点数、十六进制数、p计数法(C99/C11) %A 浮点数、十六进制数、p计数法(C99/C11) %c 单个字符 %d 有符号的十进制整数 %e 浮点数、e计数法 %E 浮点数、e计数法 %f 浮点数、十进制计数法 %g 根据值的不同，自动选择%f或%e；%e格式用于指数小于-4、大于或等于精度时 %G 根据值的不同，自动选择%f或%e；%e格式用于指数小于-4、大于或等于精度时 %i 有符号十进制整数(与%d相同) %o 指针 %p 字符串 %s 无符号八进制整数 %u 无符号十进制整数 %x 无符号十六进制整数，使用十六进制数0f %X 无符号十六进制整数，使用十六进制数0F %% 打印一个百分号 修饰符 含义 (标记) - 待打印项左对称，即从字段的左侧开始打印该项 示例：&quot;%-20s&quot; (标记) + 有符号值若为正，则在值前面显示加号 有符号值若为负，则在值前显示减号 示例：&quot;%+6.2f&quot; (标记) 空格 有符号值若为正，则在值前面显示前导空格(不显示任何符号) 若为负，则在值前面显示减号 +标记覆盖一个空格 示例：&quot;% 6.2f&quot; (标记) # 把结果转换为另一种形式： 若是#o格式，则以0开始 若是%x或%X格式，则以0x或0X开始 对所有的浮点格式，#保证了即使后面没有任何数字，也打印一个小数点字符 对%g和%G格式，#防止结果后面的0被删除 示例：&quot;%#o&quot;、&quot;%#8.0f&quot;、&quot;%+#10.3e&quot; (标记) 0 对于数值格式，用前导0代替空格填充字段宽度 对于整数格式，若出现-标记或指定精度，则忽略该标记 示例：&quot;%010d&quot;、&quot;%0.83f&quot; 数字 最小字段宽度：若该字段不能容纳待打印的数字或字符串，系统会使用更宽的字段 示例：&quot;%4d&quot; .数字 精度： 对于%e、%E、%f转换，表示小数点右边数字的位数 对于%g、G，表示有效数字最大位数 对于%s转换，表示待打印字符的最大数量 对于整形转换，表示待打印数字的最小位数 如有必要，使用前导0来达到这个位数 只使用.表示其后跟随一个0，所以%.f和%.0f相同 示例：&quot;%5.2f&quot;打印一个浮点数，字段宽度为5字符，其中小数点后有两位数字 h 和整形转换说明一起使用，表示short int或unsigned short int类型的值 示例：&quot;%hu&quot;、&quot;%hx&quot;、&quot;%6.4hd&quot; hh 和整形转换说明一起使用，表示signed char或unsigned char类型的值 示例：&quot;%hhu&quot;、&quot;%hhx&quot;、&quot;%6.4hhd&quot; j 和整形转换说明一起使用，表示intmax_t或uintmax_t类型的值(这些类型定义在stdint.h中) 示例：&quot;%jd&quot;、&quot;%8jx&quot; l 和整形转换说明一起使用，表示long int或unsigned long int类型的值 示例：&quot;%ld&quot;、&quot;%8lu&quot; ll 和整形转换说明一起使用，表示long long int或unsigned long long int类型的值(C99) 示例：&quot;%lld&quot;、&quot;%8llu&quot; L 和浮点转换说明一起使用，表示long double类型的值 示例：&quot;%Lf&quot;、&quot;%10.4Le&quot; t 和整形转换说明一起使用，表示ptrdiff_t类型的值，ptrdiff_t是两个指针差值的类型(C99) 示例：&quot;%td&quot;、&quot;%12ti&quot; z 和整形转换说明一起使用，表示size_t类型的值，size_t是sizeof返回的类型(C99) 示例：&quot;%zd&quot;、&quot;%12zd&quot; 整数类型/type 十进制/dec 八进制/octal 十六进制/hex (signed) short (int) %hd %(#)ho %(#)hx 有符号类型 (signed) int %d %(#)o %(#)x 有符号类型 (signed) long (int) %ld %(#)lo %(#)lx 有符号类型 (signed) long long (int) %lld %(#)llo %(#)llx 有符号类型 unsigned short (int) %hu 无符号类型 unsigned (int) %u 无符号类型 unsigned long (int) %lu 无符号类型 unsigned long long (int) %llu 无符号类型 (signed)/unsigned char (signed) _Bool 浮点数类型/type 十进制/dec 指数/e计数法 十六进制/hex float %f %e %a或%A 至少能表达6位有效数字 double %f %e %a或%A 至少能表达10位有效数字 long double %Lf %Le %La 至少能表达10位有效数字 4.4.2 参数传递1234567...float n1;double n2;long n3, n4;...printf(&quot;%ld %ld %ld %ld\\n&quot;, n1, n2, n3, n4);... 这是一种常见的参数传递方式，但是printf()函数读错了字节首先，程序把传入的值放入被称为栈/stack的内存区域，计算机根据变量类型而不是转换说明把这些值放入栈中然后，控制转到printf()函数，函数根据转换说明而不是变量类型从栈中读取值结果，所读取值为n1的前半部分、n1的后半部分、n2的前半部分、n2的后半部分 4.4.3 scanf()函数scanf()把输入的字符串转换成整数、浮点数、字符、字符串printf()把整数、浮点数、字符、字符串转换成显示在屏幕上的文本 scanf()和printf()都使用格式字符串和参数列表，两个函数的主要区别在参数列表中 printf()函数的参数列表使用变量、常量、表达式 scanf()函数的参数列表使用指向变量的指针 若用scanf()函数读取基本变量类型的值，在变量名前加上一个&amp; 若用scanf()函数把字符串读入字符数组中，不要使用&amp;12345678910111213&#x2F;* input.c —— 何时使用&amp; *&#x2F;#include &lt;stdio.h&gt;int main(void)&#123; int age; float assets; char pet[30]; printf(&quot;%d $%.2f %s\\n&quot;, age, assets, pet); scanf(&quot;%d %f&quot;, &amp;age, &amp;assets); &#x2F;&#x2F;基本变量类型要用&amp; scanf(&quot;%s&quot;, pet); &#x2F;&#x2F;字符数组不要使用&amp;&#125;return 0; 转换说明 含义 %c 把输入解释成字符 %d 把输入解释成有符号十进制整数 %e %f %g %a 把输入解释成浮点数 (C99标准新增%a) %E %F %G %A 把输入解释成浮点数 (C99标准新增%A) %i 把输入解释成有符号十进制整数 %o 把输入解释成有符号八进制整数 %p 把输入解释成指针 (地址) %s 把输入解释成字符串: 从第1个非空白字符开始到下一个空白字符之前的所有字符都是输入 %u 把输入解释成无符号十进制整数 %x %X 把输入解释成有符号十六进制整数 修饰符 含义 * 抑制赋值 ; 示例: %*d 数字 最大字段宽度: 输入达到最大字段宽度处，或第1次遇到空白字符时停止 ; 示例: %10s hh 把整数作为signed char或等价于unsigned char类型读取 ; 示例: %hhd %hhu ll 把整数作为long long或unsigned long long类型读取 (C99) ; 示例: %lld %llu h l L &quot;%hd&quot;、&quot;%hi&quot;表明把对应的值储存为short int类型 &quot;%ho&quot;、&quot;%hx&quot;、&quot;%hu&quot;表明把对应的值储存为unsigned short int类型 &quot;ld&quot;、&quot;li&quot;表明把对应的值储存为long类型 &quot;%lo&quot;、&quot;%lx&quot;、&quot;%lu&quot;表明把对应的值储存为unsigned long类型 &quot;%le&quot;、&quot;%lf&quot;、&quot;%lg&quot;表明把对应的值储存为double类型 在e、f、g前面使用L而不是l，表明把对应的值储存为long double类型 若无修饰符，d、i、o、x表明对应的值应被储存为int类型，f、g表明把对应的值储存为float类型 j 在整型转换说明后面时，表明使用intmax_t或uintmax_t类型 （C99) ; 示例: %jd %ju z 在整型转换说明后面时，表明使用sizeof的返回类型 (C99) ; 示例: %zd %zo t 在整型转换说明后面时，表明使用表示两个指针差值的类型 (C99) ; 示例: %td %tx 5 运算符、表达式和语句6 C控制语句：循环7 C控制语句：分支和跳转8 字符输入/输出和输入验证9 函数10 数组和指针11 字符串和字符串函数12 存储类别、链接和内存管理13 文件输入/输出14 结构和其他数据形式15 位操作16 C预处理器和C库17 高级数据表示","categories":[{"name":"CS&EE","slug":"CS-EE","permalink":"https://sunwucheng.com/wiki/categories/CS-EE/"}],"tags":[]}],"categories":[{"name":"Research","slug":"Research","permalink":"https://sunwucheng.com/wiki/categories/Research/"},{"name":"English","slug":"English","permalink":"https://sunwucheng.com/wiki/categories/English/"},{"name":"CS&EE","slug":"CS-EE","permalink":"https://sunwucheng.com/wiki/categories/CS-EE/"}],"tags":[]}